#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x38 (0x268 - 0x230)
// Class FortniteUI.FortHUDElementWidget
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTag                          ElementTag;                                        // 0x230(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 HUDElementTag;                                     // 0x238(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class ESlateVisibility                  HiddenVisibility;                                  // 0x258(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1246[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortHUDElementWidget* GetDefaultObj();

	void OnVisibilitySetEvent(enum class ESlateVisibility InVisibility);
	void HandleOnHUDResetToDefaults();
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags);
	class UFortQuickBarSlotBase* GetSpecificSlot(int32 SlotNumber);
};

// 0x10 (0x278 - 0x268)
// Class FortniteUI.LTMWidgetBase
class ULTMWidgetBase : public UFortHUDElementWidget
{
public:
	TSubclassOf<class AFortGameplayMutator>      MutatorClassToWaitFor;                             // 0x268(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1251[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ULTMWidgetBase* GetDefaultObj();

	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	void OnGamePhaseChanged(enum class EAthenaGamePhase NewPhase);
	uint8 GetViewingTeam();
};

// 0x18 (0x290 - 0x278)
// Class FortniteUI.AshtonWidgetBase
class UAshtonWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Ashton*             AshtonMutatorRef;                                  // 0x278(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1255[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAshtonWidgetBase* GetDefaultObj();

	void UpdateAllUI(bool bFirstUpdate);
	void OnVillainRespawnsRemainingChanged();
	void OnVillainRespawnCountChanged(int32 NumRespawnsLeft, float RespawnPercentLeft);
	void OnStoneListChanged();
	void OnStoneChanged(enum class EAshtonStoneType StoneType, enum class EAshtonStoneStateType StoneState);
	void OnOpenWidget();
	void OnCloseWidget();
};

// 0x20 (0x50 - 0x30)
// Class FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys
class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys : public UBlueprintAsyncActionBase
{
public:
	UMulticastInlineDelegateProperty_            Finished;                                          // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortPlayerSurveyDispatcher*           Dispatcher;                                        // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_125D[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* GetDefaultObj();

	void OnAllSurveysFinishedDelegate__DelegateSignature();
	void HandleAllSurveysFinished(class UObject* Source);
	class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* DisplaySurveys(class UFortPlayerSurveyDispatcher* Dispatcher, int32 SurveyCount);
};

// 0x0 (0x30 - 0x30)
// Class FortniteUI.AthenaAccountContext
class UAthenaAccountContext : public UBlueprintContextBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaAccountContext* GetDefaultObj();

	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);
	bool ShouldReplaceBattleStarsWithAlternateReward();
	bool IsAtMaxBattlePassTier();
	class FText GetCurrentSeasonNumberAsText();
	int32 GetCurrentSeasonNumber();
	class FText GetCurrentSeasonName();
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
};

// 0x18 (0x280 - 0x268)
// Class FortniteUI.AthenaAIKillsBase
class UAthenaAIKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            KillsText;                                         // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               KillsSource;                                       // 0x270(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomKillSource;                                 // 0x278(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1276[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAIKillsBase* GetDefaultObj();

	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};

// 0x8 (0x230 - 0x228)
// Class FortniteUI.AthenaAwardAlertBase
class UAthenaAwardAlertBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x228(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaAwardAlertBase* GetDefaultObj();

	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
};

// 0x8 (0x230 - 0x228)
// Class FortniteUI.AthenaBattleMapClickHandler
class UAthenaBattleMapClickHandler : public UUserWidget
{
public:
	uint8                                        Pad_1286[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapClickHandler* GetDefaultObj();

	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
};

// 0x48 (0x278 - 0x230)
// Class FortniteUI.AthenaBattleMapNodeTooltip
class UAthenaBattleMapNodeTooltip : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      TextBlock_NodeTitle;                               // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_NodeDescription;                         // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_NodeTime;                                // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_Selection;                                  // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_Scrubbing;                                  // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_ScrubbingGamepad;                           // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1295[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapNodeTooltip* GetDefaultObj();

	void OnReplayLevelStreamingChanged(bool bStreaming);
	void HandleUnhoveredNode(class ABattleMapNode* Node, enum class EBattleMapHoveredReason Reason);
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
	void HandleTimelineModeChanged(bool bEnabled);
	void HandleInputMethodChanged(enum class ECommonInputType NewInputType);
	void HandleHoveredNode(class ABattleMapNode* Node, enum class EBattleMapHoveredReason Reason);
	void HandleCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType);
};

// 0x28 (0x340 - 0x318)
// Class FortniteUI.FortActivatablePanel
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                         bIsPushedOnToContentPanelStack;                    // 0x318(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAlreadyOnContentPanelStack;                     // 0x319(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInputPriority                    InputPriority;                                     // 0x31A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsClosableByPlayerInput;                          // 0x31B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A0[0x24];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortActivatablePanel* GetDefaultObj();

	void RestoreScrollWidget(class UWidget* FallbackWidget);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void AsyncPlaySound2D(class UObject* WorldContextObject, TSoftObjectPtr<class USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime);
};

// 0xC0 (0x400 - 0x340)
// Class FortniteUI.AthenaBattleMapTimelineWidget
class UAthenaBattleMapTimelineWidget : public UFortActivatablePanel
{
public:
	class UCommonButton*                         Button_Forward;                                    // 0x340(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Backward;                                   // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ForwardButtonPositionAlpha;                        // 0x350(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BackwardButtonPositionAlpha;                       // 0x354(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ForwardDataTableRow;                               // 0x358(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   BackwardDataTableRow;                              // 0x368(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   StopDataTableRow;                                  // 0x378(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ScrubToDataTableRow;                               // 0x388(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ExitBattleMapDataTableRow;                         // 0x398(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ZoomInDataTableRow;                                // 0x3A8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ZoomOutDataTableRow;                               // 0x3B8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12BD[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapTimelineWidget* GetDefaultObj();

	void OnReplayLevelStreamingChanged(bool bStreaming);
	void HandleZoomOutPressed(bool* bPassThrough);
	void HandleZoomOutHeld(float HeldPercent);
	void HandleZoomInPressed(bool* bPassThrough);
	void HandleZoomInHeld(float HeldPercent);
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
	void HandleTimelineStopPressed(bool* bPassThrough);
	void HandleTimelineScrubToPressed(bool* bPassThrough);
	void HandleTimelineModeChanged(bool bEnabled);
	void HandleTimelineForwardPressed(bool* bPassThrough);
	void HandleTimelineBackwardPressed(bool* bPassThrough);
	void HandleSelectedNode(class ABattleMapNode* InSelectedNode);
	void HandleInputMethodChanged(enum class ECommonInputType NewInputType);
	void HandleExitBattleMapPressed(bool* bPassThrough);
	void HandleCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType);
};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.AthenaEventScreenBase
class UAthenaEventScreenBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventScreenBase* GetDefaultObj();

};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.AthenaBroadcastAllPlayersGridBase
class UAthenaBroadcastAllPlayersGridBase : public UAthenaEventScreenBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaBroadcastAllPlayersGridBase* GetDefaultObj();

	void OnPlayerDataAdded_BP(class UAthenaRemotePlayerViewData* InPlayerData);
};

// 0x8 (0x270 - 0x268)
// Class FortniteUI.AthenaBroadcastFollowedPlayerInfoBase
class UAthenaBroadcastFollowedPlayerInfoBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_12CD[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastFollowedPlayerInfoBase* GetDefaultObj();

	void OnVehicleStateChanged(class UAthenaRemotePlayerViewData* PlayerData, class AActor* NewVehicle, class AActor* OldVehicle);
	void OnPipModeChanged(bool bPipModeEnabled);
	void OnFollowedPlayerDataChanged(class UAthenaRemotePlayerViewData* InFollowedPlayerData);
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatingPC, class AFortPlayerState* FollowedPlayerState);
	void OnEliminatedStateChanged(class UAthenaRemotePlayerViewData* PlayerData, bool bIsEliminated);
};

// 0x20 (0x288 - 0x268)
// Class FortniteUI.AthenaGamePhaseWidgetBase
class UAthenaGamePhaseWidgetBase : public UFortHUDElementWidget
{
public:
	class UMaterialInterface*                    StormComingFontMaterial;                           // 0x268(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StormComingWarningTime;                            // 0x270(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_12D6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTextBlock*                            TimeText;                                          // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_12D7[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGamePhaseWidgetBase* GetDefaultObj();

	void OnGameStateSet(class AFortGameState* InGameState);
	void OnGamePhaseStepChanged(enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleGamePhaseStepChanged(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
};

// 0x8 (0x290 - 0x288)
// Class FortniteUI.AthenaBroadcastGamePhaseWidget
class UAthenaBroadcastGamePhaseWidget : public UAthenaGamePhaseWidgetBase
{
public:
	class AFortMinigame*                         MinigameOverride;                                  // 0x288(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastGamePhaseWidget* GetDefaultObj();

	void SetMinigameOverride(class AFortMinigame* Minigame);
};

// 0x18 (0x358 - 0x340)
// Class FortniteUI.FortUIStateWidget_NUI
class UFortUIStateWidget_NUI : public UFortActivatablePanel
{
public:
	uint8                                        Pad_12F9[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FContentPushState>             StackStates;                                       // 0x348(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortUIStateWidget_NUI* GetDefaultObj();

	void SetFrontEndVisibility(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void RequestOpenSocialMenu();
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void PushContentWidgetAdvanced(class UWidget* Widget, bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PushContentWidget(class UWidget* Widget);
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	class UWidget* PopContentWidget();
	void PopAllContentWidgets();
	void OnLoadingScreenVisibilityChanged(bool IsVisible);
	void OnHUDScaleChanged(float HUDScale);
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void OnExitState(enum class EFortUIState NextUIState);
	void OnEnterState(enum class EFortUIState PreviousUIState);
	void DynamicHandleLoadingScreenVisibilityChanged(bool IsVisible);
};

// 0x70 (0x3C8 - 0x358)
// Class FortniteUI.AthenaHUDBase
class UAthenaHUDBase : public UFortUIStateWidget_NUI
{
public:
	TArray<class UUserWidget*>                   MinigameWidgets;                                   // 0x358(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1322[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaPlayerViewModel*                PlayerViewModel;                                   // 0x378(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                              ScalableOverlay;                                   // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>               KairosHUDLayerClass;                               // 0x388(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1323[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FPlaylistUIExtension>          TournamentUIExtensions;                            // 0x3A8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FPlaylistUIExtension>          ArenaTournamentUIExtensions;                       // 0x3B8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaHUDBase* GetDefaultObj();

	void ViewModelChanged(class UAthenaPlayerViewModel* ViewModel);
	void UpdateUIExtensions(class AFortPlayerState* ClientState, class AFortMinigame* Minigame);
	void SetQuickBarNative(bool bShouldDoQuickBarNative);
	void SetFullScreenMapVisibility(bool bIsVisible);
	void OnPlaylistExtensionWidgetCreated(enum class EPlaylistUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnMinigameHideHUD(bool bLoading);
	void HandleVolumeUnloaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeStateChanged(enum class EVolumeState NewState, class AFortVolume* Volume);
	void HandleVolumeLoaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleUpdateMinigameUIExtensions(class AFortMinigame* Minigame);
	void HandleExitVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleEnteredVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleCursorModeChanging(bool bCursorModeEnabled);
	void ClearUIExtensions();
	void BindVolumeEvents();
};

// 0x8 (0x3D0 - 0x3C8)
// Class FortniteUI.AthenaSpectatorHUDBase
class UAthenaSpectatorHUDBase : public UAthenaHUDBase
{
public:
	class UAthenaSpectatorNameplateLayerBase*    NameplateLayer;                                    // 0x3C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaSpectatorHUDBase* GetDefaultObj();

	void OnUnableToPerformAction(const struct FGameplayTagContainer& FailedReason, class FText& FailureText);
	void OnPlayerTargetingChanged(bool bIsTargeting);
	void OnIndicatorModeChanged(bool bIndicatorsEnabled);
	void OnFollowedPlayerRespawnTimeChanged(float RespawnTime);
	void OnCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void HandleSpectatorViewTargetChanged();
	void HandleNameplatesEnabledChanged(bool bInNameplatesEnabled);
};

// 0x130 (0x500 - 0x3D0)
// Class FortniteUI.AthenaBroadcastHUDBase
class UAthenaBroadcastHUDBase : public UAthenaSpectatorHUDBase
{
public:
	class UAthenaSpectatorHUDControlsBase*       BroadcastHUDControls;                              // 0x3D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcher*                 EventMatchInfoSwitcher;                            // 0x3D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleMatchStatusActionRowHandle;                  // 0x3E0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleSquadStatusActionRowHandle;                  // 0x3F0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleRemainingPlayersActionRowHandle;             // 0x400(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleActiveGridScreenActionRowHandle;             // 0x410(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleEliminatedGridScreenActionRowHandle;         // 0x420(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleMatchStatusScreenActionRowHandle;            // 0x430(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleScoreboardScreenActionRowHandle;             // 0x440(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleKillFeedActionRowHandle;                     // 0x450(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleActionFeedScreenActionRowHandle;             // 0x460(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleGotoTimeRowHandle;                           // 0x470(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleAllPlayersGridActionRowHandle;               // 0x480(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   TogglePipModeActionRowHandle;                      // 0x490(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleFollowedPlayerInfoActionRowHandle;           // 0x4A0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UUserWidget>, struct FPlaylistUIExtension> ExtensionWidgetOverrides;                          // 0x4B0(0x50)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDBase* GetDefaultObj();

	void OnVolumeEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnVolumeBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnVolumeAdded(class AFortVolume* Volume);
	void OnToggleSquadStatusActionExecuted(bool* bPassThrough);
	void OnToggleScoreboardScreenActionExecuted(bool* bPassThrough);
	void OnToggleRemainingPlayersActionExecuted(bool* bPassThrough);
	void OnTogglePipModeActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusScreenActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusActionExecuted(bool* bPassThrough);
	void OnToggleKillFeedActionExecuted(bool* bPassThrough);
	void OnToggleGoToTimeScreen(bool* bPassThrough);
	void OnToggleFollowedPlayerInfoActionExecuted(bool* bPassThrough);
	void OnToggleEliminatedGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleAllPlayersGridActionExecuted(bool* bPassThrough);
	void OnToggleActiveGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleActionFeedScreenActionExecuted(bool* bPassThrough);
	void OnPlaylistDataChanged(class UFortPlaylistAthena* PlaylistData);
	void OnPipModeChanged(bool bEnabled);
	void OnMinigameChanged(class AFortMinigame* NewMinigame);
	void OnGameStateSet_BP(class AFortGameStateAthena* GameStateAthena);
	void OnGameStateSet(class AFortGameState* NewGameState);
	void OnCurrentPlaylistChanged();
};

// 0x38 (0x2A0 - 0x268)
// Class FortniteUI.FortActorIndicatorWidget
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_135E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                IndicatedActor;                                    // 0x270(0x8)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                   IndicatedActorComponent;                           // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               RelativeLocation;                                  // 0x280(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxDistance;                                       // 0x28C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bClampOnScreen;                                    // 0x290(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowClampToScreenArrow;                           // 0x291(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseScreenSpacePosition;                           // 0x292(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1362[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             ScreenSpaceRelativeOffset;                         // 0x294(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ScreenPriority;                                    // 0x29C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortActorIndicatorWidget* GetDefaultObj();

};

// 0x8 (0x2A8 - 0x2A0)
// Class FortniteUI.AthenaBroadcastHUDMenuStatusBase
class UAthenaBroadcastHUDMenuStatusBase : public UFortActorIndicatorWidget
{
public:
	float                                        ZOffset;                                           // 0x2A0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1365[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDMenuStatusBase* GetDefaultObj();

	void MapActivated();
	void InventoryActivated();
};

// 0x10 (0x278 - 0x268)
// Class FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase
class UAthenaBroadcastHUDMenuStatusLayerBase : public UFortHUDElementWidget
{
public:
	TSubclassOf<class UAthenaBroadcastHUDMenuStatusBase> HUDMenuStatusWidgetClass;                          // 0x268(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1370[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDMenuStatusLayerBase* GetDefaultObj();

	void RemoveHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
	void DeactivateHudMenuWidget();
	void AddHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
};

// 0x28 (0x290 - 0x268)
// Class FortniteUI.AthenaBroadcastKillFeedBase
class UAthenaBroadcastKillFeedBase : public UFortHUDElementWidget
{
public:
	class UFortDynamicEntryBox*                  KillFeedEntryBox;                                  // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeToShowEntry;                                   // 0x270(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_137C[0x1C];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastKillFeedBase* GetDefaultObj();

	void OnToggleShowKillFeed(bool bShowKillFeed);
	void OnTimelineScrubbed();
	void AddKillFeedEntry(struct FAthenaBroadcastKillFeedEntryInfo& KillFeedEntryInfo);
};

// 0xE8 (0x350 - 0x268)
// Class FortniteUI.AthenaBroadcastKillFeedItemBase
class UAthenaBroadcastKillFeedItemBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_137E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UMaterialInterface>     EliminationIcon;                                   // 0x270(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     StormIcon;                                         // 0x298(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     FallDamageIcon;                                    // 0x2C0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     ExplosionIcon;                                     // 0x2E8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     DbnoIcon;                                          // 0x310(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_InstigatorName;                               // 0x338(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_VictimName;                                   // 0x340(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_EntryIcon;                                   // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastKillFeedItemBase* GetDefaultObj();

};

// 0x8 (0x348 - 0x340)
// Class FortniteUI.AthenaBroadcastMapPanelBase
class UAthenaBroadcastMapPanelBase : public UFortActivatablePanel
{
public:
	class UAthenaSpectatorMapPlayerListBase*     PlayerList;                                        // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastMapPanelBase* GetDefaultObj();

	void OnShowEventScoresChanged(bool bShowEventScores);
	void OnMapIconAdded(class UFortSpectateClickableMapIcon* MapIconIn);
};

// 0x8 (0x270 - 0x268)
// Class FortniteUI.AthenaBroadcastMatchStatusWidget
class UAthenaBroadcastMatchStatusWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_1383[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastMatchStatusWidget* GetDefaultObj();

	void OnStormPhaseChanged(int32 StormPhase);
};

// 0x10 (0x278 - 0x268)
// Class FortniteUI.AthenaBroadcastPlayerEventScoreWidget
class UAthenaBroadcastPlayerEventScoreWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                      PlayerEventScoreText;                              // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcher*                 PlayerEventScoreSwitcher;                          // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastPlayerEventScoreWidget* GetDefaultObj();

	void OnRemoteClientEventScoreChanged(int32 NewEventScore);
};

// 0x8 (0x270 - 0x268)
// Class FortniteUI.AthenaBroadcastPlayerLocationWidget
class UAthenaBroadcastPlayerLocationWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                      PlayerLocationText;                                // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastPlayerLocationWidget* GetDefaultObj();

	void OnRemoteClientPoiTagIDChanged(int16 RemoteClientPoiTagID);
};

// 0x8 (0x270 - 0x268)
// Class FortniteUI.AthenaBroadcastSessionId
class UAthenaBroadcastSessionId : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            Text_SessionId;                                    // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastSessionId* GetDefaultObj();

};

// 0x8 (0x270 - 0x268)
// Class FortniteUI.AthenaEventMatchSquadWidgetBase
class UAthenaEventMatchSquadWidgetBase : public UFortHUDElementWidget
{
public:
	TWeakObjectPtr<class UAthenaRemoteSquadViewData> SquadData;                                         // 0x268(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaEventMatchSquadWidgetBase* GetDefaultObj();

	void SetSquadIdVisible(bool bSquadIdVisible);
	void OnSquadPlaceChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadPlace);
	void OnSquadKillscoreChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadKills);
	void OnSquadIdChanged(class UAthenaRemoteSquadViewData* InSquadData, uint8 InSquadId);
	void OnSquadColorChanged(class UAthenaRemoteSquadViewData* InSquadData, const struct FLinearColor& InSquadColor);
	void OnPlayerAdded(class UAthenaRemoteSquadViewData* InSquadData, class UAthenaRemotePlayerViewData* InPlayerData);
};

// 0x28 (0x298 - 0x270)
// Class FortniteUI.AthenaBroadcastSquadStatusWidget
class UAthenaBroadcastSquadStatusWidget : public UAthenaEventMatchSquadWidgetBase
{
public:
	struct FUniqueNetIdRepl                      FollowedPlayerUID;                                 // 0x270(0x28)(BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastSquadStatusWidget* GetDefaultObj();

	void OnPipModeChanged(bool bPipModeEnabled);
	void OnMinigameTeamIdChanged(class UFortMinigameTeamIdentification* MinigameTeamId);
	void OnFollowedPlayerChanged();
	void HandleSquadIdChanged(class UAthenaRemoteSquadViewData* InSquadData, uint8 SquadId);
	void HandleFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorController, class AFortPlayerState* NewFollowedPlayer);
};

// 0x90 (0x2B8 - 0x228)
// Class FortniteUI.AthenaChallengeCountdownDisplay
class UAthenaChallengeCountdownDisplay : public UUserWidget
{
public:
	uint8                                        Pad_13C9[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ECountdownDisplay                 DisplayType;                                       // 0x238(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_13CB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerDisplayData                     DisplayData[0x2];                                  // 0x240(0x70)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_TimeRemaining;                                // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeCountdownDisplay* GetDefaultObj();

	void OnChallengeSet(struct FTimerDisplayData& DisplayStyle);
};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.AthenaChallengeDetailBase
class UAthenaChallengeDetailBase : public UCommonUserWidget
{
public:
	class UFortItemBaseWidget*                   ItemInfo_PreviewedItem;                            // 0x230(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              SB_MainContent;                                    // 0x238(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailBase* GetDefaultObj();

};

// 0xA0 (0x2E0 - 0x240)
// Class FortniteUI.AthenaChallengeDetailImageGrid
class UAthenaChallengeDetailImageGrid : public UAthenaChallengeDetailBase
{
public:
	uint8                                        Pad_13D1[0x78];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UUniformGridPanel*                     Grid_Image;                                        // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>               EntryWidgetClass;                                  // 0x2C0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CurrentFocusedSlot;                                // 0x2C8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_13D2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        QuestIds;                                          // 0x2D0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailImageGrid* GetDefaultObj();

	void OnOwnedToCompleteTransitions(int32 Count, float TimeOffset, float AdditionalTime);
	void OnLockedToOwnedTransitions(int32 Count, float TimeOffset, float AdditionalTime);
};

// 0x20 (0x260 - 0x240)
// Class FortniteUI.AthenaChallengeDetailList
class UAthenaChallengeDetailList : public UAthenaChallengeDetailBase
{
public:
	bool                                         bSkipItemDisplay;                                  // 0x240(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSuppressItemDisplay;                              // 0x241(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13D4[0x16];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaChallengeSetListView*           ChallengeListView_SetContents;                     // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailList* GetDefaultObj();

};

// 0x38 (0x278 - 0x240)
// Class FortniteUI.AthenaChallengeDetailRewardTrack
class UAthenaChallengeDetailRewardTrack : public UAthenaChallengeDetailBase
{
public:
	uint8                                        Pad_13D9[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumRewardsBeforeScrolling;                         // 0x250(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowWrapping;                                    // 0x254(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bScrollingRewards;                                 // 0x255(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_13DD[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CurrentBundleLevelBeingViewed;                     // 0x258(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CurrentRewardBeingViewed;                          // 0x25C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 Switcher_RewardTrack;                              // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_RewardTrack_Small;                        // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_RewardTrack_Scroll;                       // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailRewardTrack* GetDefaultObj();

	void HandlePreviewItemChanged(int32 RewardIndexToView);
};

// 0x178 (0x1A8 - 0x30)
// Class FortniteUI.AthenaChallengeDisplayData
class UAthenaChallengeDisplayData : public UDataAsset
{
public:
	int32                                        SoonDisplayMinuteThreshold;                        // 0x30(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          PartyAssistFontColor;                              // 0x34(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          DifficultChallengeFontColor;                       // 0x44(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13E1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            PartyAssistIcon;                                   // 0x58(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            ExternalPartyAssistIcon;                           // 0x60(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortChallengeSetStyle                DefaultChallengeStyle;                             // 0x68(0xA0)(Edit, NativeAccessSpecifierPublic)
	struct FFortChallengeSetStyle                DailyChallengeStyle;                               // 0x108(0xA0)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaChallengeDisplayData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaChallengeDisplayLibrary
class UAthenaChallengeDisplayLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeDisplayLibrary* GetDefaultObj();

	struct FLinearColor GetChallengeStyleLightAccentColor(struct FFortChallengeSetStyle& DisplayStyle);
	void ApplyChallengeSetStyleColorsToMaterial(struct FFortChallengeSetStyle& DisplayStyle, class UMaterialInstanceDynamic* StyleMaterial);
	void ApplyChallengeSetStyleColorsToImageMaterial(struct FFortChallengeSetStyle& DisplayStyle, class UImage* ImageWidget);
};

// 0x18 (0x40 - 0x28)
// Class FortniteUI.ImageGridObject
class UImageGridObject : public UObject
{
public:
	int32                                        GridLocation;                                      // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13E8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortChallengeBundleItemDefinition*    BundleData;                                        // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortQuestItem*                        QuestItem;                                         // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UImageGridObject* GetDefaultObj();

};

// 0x48 (0xB88 - 0xB40)
// Class FortniteUI.AthenaChallengeImageGridEntry
class UAthenaChallengeImageGridEntry : public UCommonButton
{
public:
	uint8                                        Pad_13F2[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonLazyImage*                      Image_Brush;                                       // 0xB58(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bSelected;                                         // 0xB60(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_13F6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GridLocation;                                      // 0xB64(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Column;                                            // 0xB68(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Row;                                               // 0xB6C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_13F9[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeImageGridEntry* GetDefaultObj();

	void TransitionFromOwnedToCompletedState();
	void TransitionFromLockedToOwnedState();
	void SetupLockedToOwnState();
	void OnChallengeSet(bool bIsComplete, bool bIsLocked);
};

// 0x28 (0x258 - 0x230)
// Class FortniteUI.AthenaChallengeInfoPanelEntry
class UAthenaChallengeInfoPanelEntry : public UCommonUserWidget
{
public:
	uint8                                        Pad_13FF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_AssistIcon;                                  // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_AssistTarget;                             // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ChallengeDesc;                            // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeInfoPanelEntry* GetDefaultObj();

	void OnLocalPlayerMissingAssistedChallenge();
	void OnChallengeInfoSet();
	void HandleQuestsUpdated();
};

// 0x58 (0x288 - 0x230)
// Class FortniteUI.AthenaChallengeInfoPanel
class UAthenaChallengeInfoPanel : public UCommonUserWidget
{
public:
	uint8                                        Pad_1409[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EChallengeInfoPage                CurrentPage;                                       // 0x240(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_140A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   CyclePagesInputAction;                             // 0x248(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	int32                                        MaxSuggestedEntries;                               // 0x258(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_140B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class UFortPartyMember>> PartyMembersWithAssistedChallenges;                // 0x260(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_140C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_DisplayedChallengeTypes;                      // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Challenges;                               // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeInfoPanel* GetDefaultObj();

	void HandleQuestsUpdatedInGame();
	void HandleCycleQuestsInputAction(bool* bPassThrough);
};

// 0x70 (0x2A0 - 0x230)
// Class FortniteUI.AthenaMissionInfoPanel
class UAthenaMissionInfoPanel : public UCommonUserWidget
{
public:
	int32                                        MaxSuggestedEntries;                               // 0x230(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1410[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class UFortPartyMember>> PartyMembersWithAssistedChallenges;                // 0x238(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1411[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  PrestigeShimmerParamName;                          // 0x250(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ContextColorParamName;                             // 0x258(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  MissionRewardParamName;                            // 0x260(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_DisplayedChallengeTypes;                      // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeName;                                // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Challenges;                               // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ViewNextMission;                            // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewardDisplayEntry*    MissionReward;                                     // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_MissionIcon;                              // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                TimerImage;                                        // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMissionInfoPanel* GetDefaultObj();

	void SetMissionStyle(const struct FFortChallengeSetStyle& Style);
	void HandleCycleMissionClicked();
};

// 0x20 (0x250 - 0x230)
// Class FortniteUI.AthenaInGameChallengeInfoPanel
class UAthenaInGameChallengeInfoPanel : public UCommonUserWidget
{
public:
	int32                                        TotalMaxEntries;                                   // 0x230(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_141A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaChallengeInfoPanel*             ChallengeInfo_PartyAssist;                         // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeInfoPanel*             ChallengeInfo_Daily;                               // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeInfoPanel*             ChallengeInfo_Suggested;                           // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaInGameChallengeInfoPanel* GetDefaultObj();

};

// 0x10 (0x238 - 0x228)
// Class FortniteUI.AthenaChallengeRewardDisplayEntry
class UAthenaChallengeRewardDisplayEntry : public UUserWidget
{
public:
	class UFortLazyImage*                        LazyImage_RewardIcon;                              // 0x228(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonTextBlock*                      Text_RewardQuantity;                               // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardDisplayEntry* GetDefaultObj();

};

// 0x10 (0x238 - 0x228)
// Class FortniteUI.AthenaChallengeRewardDisplay
class UAthenaChallengeRewardDisplay : public UUserWidget
{
public:
	class UDynamicEntryBox*                      EntryBox_Rewards;                                  // 0x228(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_CompletionIcon;                              // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardDisplay* GetDefaultObj();

};

// 0x8 (0x238 - 0x230)
// Class FortniteUI.AthenaChallengeListEntryBase
class UAthenaChallengeListEntryBase : public UCommonUserWidget
{
public:
	uint8                                        Pad_1425[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntryBase* GetDefaultObj();

	void StartHighlight();
	void EndHighlight();
};

// 0x20 (0x258 - 0x238)
// Class FortniteUI.AthenaChallengeTreeEntry_ChallengeSet
class UAthenaChallengeTreeEntry_ChallengeSet : public UAthenaChallengeListEntryBase
{
public:
	uint8                                        Pad_142C[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_ChallengeSetName;                             // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeSetContext;                          // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeTreeEntry_ChallengeSet* GetDefaultObj();

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle);
};

// 0x28 (0x260 - 0x238)
// Class FortniteUI.AthenaChallengeListEntry_Challenge
class UAthenaChallengeListEntry_Challenge : public UAthenaChallengeListEntryBase
{
public:
	uint8                                        Pad_143F[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHideProgressBar;                                  // 0x248(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1441[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonRichTextBlock*                  RichText_ChallengeDesc;                            // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_Challenge* GetDefaultObj();

	void OnPartyAssistEnabledChanged(bool bIsPartyAssistEnabled);
	void OnChallengeInfoSet(bool bIsComplete, bool bIsLocked, bool bCompact, bool HideRewards);
	int32 GetChallengeWeight();
};

// 0x68 (0x2C8 - 0x260)
// Class FortniteUI.AthenaChallengeListEntry_DetailedChallenge
class UAthenaChallengeListEntry_DetailedChallenge : public UAthenaChallengeListEntry_Challenge
{
public:
	uint8                                        Pad_1449[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHasAnyOptionsAvailable;                           // 0x270(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsDisplayingChallengeActions;                     // 0x271(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_144A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   BackAction;                                        // 0x278(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   CloseChallengeOptionsAction;                       // 0x288(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_ShowChallengeOptions;                    // 0x298(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               SimpleButton_TopClickArea;                         // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewardDisplay*         Reward_QuestReward;                                // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_PartyAssist;                                // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ReplaceChallenge;                           // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ActionInfo;                               // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_DetailedChallenge* GetDefaultObj();

	void HandleUpperAreaClicked();
	void HandleCloseChallengeOptionsInputAction(bool* bPassThrough);
};

// 0x8 (0x240 - 0x238)
// Class FortniteUI.AthenaChallengeListEntry_Header
class UAthenaChallengeListEntry_Header : public UAthenaChallengeListEntryBase
{
public:
	class UCommonTextBlock*                      Text_SectionTitle;                                 // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_Header* GetDefaultObj();

	void OnSectionTypeSet(enum class EChallengeListSection SectionType);
};

// 0x18 (0x250 - 0x238)
// Class FortniteUI.AthenaChallengeListEntry_CompletionReward
class UAthenaChallengeListEntry_CompletionReward : public UAthenaChallengeListEntryBase
{
public:
	class UAthenaChallengeRewardDisplay*         Reward_CompletionReward;                           // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_CompletionReward* GetDefaultObj();

	void OnRewardInfoSet(bool bIsCompleted, struct FFortChallengeSetStyle& DisplayStyle);
};

// 0x48 (0x280 - 0x238)
// Class FortniteUI.AthenaChallengeListEntry_StoreOffer
class UAthenaChallengeListEntry_StoreOffer : public UAthenaChallengeListEntryBase
{
public:
	TSoftClassPtr<class UFortStoreFrontOfferDetailsWidgetBase> OfferDetailsWidgetClass;                           // 0x238(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortStoreFrontOfferInfo*              OfferInfo;                                         // 0x260(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               SimpleButton_ClickArea;                            // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        LazyImage_SpecialOffer;                            // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_StoreOffer* GetDefaultObj();

	void OnOfferSet();
	void HandleClicked();
};

// 0xE8 (0x2E8 - 0x200)
// Class FortniteUI.AthenaChallengeListViewBase
class UAthenaChallengeListViewBase : public UListViewBase
{
public:
	uint8                                        Pad_145B[0xE0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EntrySpacing;                                      // 0x2E0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_145C[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeListViewBase* GetDefaultObj();

};

// 0x10 (0x238 - 0x228)
// Class FortniteUI.AthenaChallengeProgressBar
class UAthenaChallengeProgressBar : public UUserWidget
{
public:
	class UProgressBar*                          ProgressBar_StepsCompleted;                        // 0x228(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Progress;                                 // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeProgressBar* GetDefaultObj();

	void SetPercentValueForMaterialNumber(int32 PercentValue);
};

// 0x68 (0x298 - 0x230)
// Class FortniteUI.AthenaChallengeRewardTrackEntry
class UAthenaChallengeRewardTrackEntry : public UCommonUserWidget
{
public:
	class FName                                  MissionRewardParamName;                            // 0x230(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortItemDefinition>    RewardToRepresent;                                 // 0x238(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        BundleRewardIndex;                                 // 0x260(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1469[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_ConnectorLeft;                               // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ConnectorRight;                              // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewardDisplayEntry*    MissionReward;                                     // 0x278(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_146A[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardTrackEntry* GetDefaultObj();

	void StyleChange(bool bViewingPrestige);
	void SetToDefaultState();
	void SetAsCurrentPreviewItem();
	void NextRewardToEarn(bool bNext);
	void CompletedNextNode(bool bAnimate);
	void CompletedCurrentNode(bool bAnimate, bool LastReward);
	void ClearPreviewSelection();
};

// 0x10 (0xB50 - 0xB40)
// Class FortniteUI.ChallengeScreenCategoryTab
class UChallengeScreenCategoryTab : public UCommonButton
{
public:
	class UCommonTextBlock*                      Text_TabName;                                      // 0xB40(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_146E[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChallengeScreenCategoryTab* GetDefaultObj();

};

// 0xD8 (0x3F0 - 0x318)
// Class FortniteUI.AthenaChallengeScreen
class UAthenaChallengeScreen : public UCommonActivatablePanel
{
public:
	TSubclassOf<class UAthenaChallengeSetBaseDetails> DefaultDetailsWidgetClass;                         // 0x318(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FDetailClassEntry>             DetailWidgestClasses;                              // 0x320(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   NextCategoryInputAction;                           // 0x330(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   PrevCategoryInputAction;                           // 0x340(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<class UAthenaChallengeSetBaseDetails*> CreatedDetailWidgets;                              // 0x350(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UAthenaChallengeSetBaseDetails*        ActiveDetailsWidget;                               // 0x360(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeScreenTileBase*        LastSelectedTile;                                  // 0x368(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1481[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButtonGroup*                    TabButtonGroup;                                    // 0x378(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1482[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UDynamicEntryBox*                      EntryBox_SectionTabs;                              // 0x3B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            ScrollBox_Sections;                                // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_EventChallenges;                          // 0x3C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeScreenTile_Daily*      ChallengeTile_Dailies;                             // 0x3C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_WeeklyChallenges;                         // 0x3D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Row1_MissionChallenges;                   // 0x3D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Row2_MissionChallenges;                   // 0x3E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_StyleChallenges;                          // 0x3E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeScreen* GetDefaultObj();

	bool IsPartyAssistedChallengeSet();
	void HandleTabSelectionChanged(class UCommonButton* TabButton, int32 TabIdx);
	void HandleTabClicked(class UCommonButton* TabButton, int32 TabIdx);
	void HandlePrevCategoryAction(bool* bPassThrough);
	void HandleNextCategoryAction(bool* bPassThrough);
	void HandleDetailsDeactivated(class UCommonActivatablePanel* DetailsPanel);
};

// 0x128 (0x468 - 0x340)
// Class FortniteUI.FortActivatablePanelWithItemPreview
class UFortActivatablePanelWithItemPreview : public UFortActivatablePanel
{
public:
	uint8                                        Pad_14A0[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItemView*                         ItemViewObject;                                    // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedSupportsCameraControlInputAction;   // 0x350(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedZoomInputAction;                    // 0x360(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomOutInputAction;                        // 0x370(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomInInputAction;                         // 0x380(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewRotateInputAction;                         // 0x390(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_14A5[0x94];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         AllowItemRotation;                                 // 0x434(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         AllowItemZooming;                                  // 0x435(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         AutomaticallyRegisterCameraView;                   // 0x436(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         OverrideFixedCameras;                              // 0x437(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                            ActionDataTable;                                   // 0x438(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      AnimationToHideItemInfo;                           // 0x440(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoShowDetails;                                  // 0x448(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bItemDetailsHidden;                                // 0x449(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14A7[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HideItemInfoHeaderDurationSecs;                    // 0x44C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14A8[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortActivatablePanelWithItemPreview* GetDefaultObj();

	void ShowItemDetails();
	void OnVaultItemsViewed(TArray<class UFortItem*>& Items);
	void OnItemPreviewChanged(class AActor* NewPrefab, class UFortItem* NewItem);
	void OnCosmeticSpecialActionPressed_7(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_6(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_5(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_4(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_3(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_2(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_1(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_0(bool* bPassThrough);
	void HideItemDetails();
	class UWidget* GetWidgetForFramingViewedItem();
};

// 0x20 (0x488 - 0x468)
// Class FortniteUI.AthenaChallengeSetBaseDetails
class UAthenaChallengeSetBaseDetails : public UFortActivatablePanelWithItemPreview
{
public:
	uint8                                        Pad_14AE[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeSetBaseDetails* GetDefaultObj();

};

// 0x78 (0x500 - 0x488)
// Class FortniteUI.AthenaChallengeSetDetails
class UAthenaChallengeSetDetails : public UAthenaChallengeSetBaseDetails
{
public:
	uint8                                        Pad_14B3[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_ChallengeContext;                             // 0x4A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_ChallengeSetName;                             // 0x4B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaChallengeProgressBar*           ChallengeProgress_Completion;                      // 0x4B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0x4C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSwipePanel*                       SwipePanel_ChangeSet;                              // 0x4C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                          VB_ChallengeExtensions;                            // 0x4D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaChallengeDetailBase*            ChallengeDetail_ListPanel;                         // 0x4D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              SB_MainContent;                                    // 0x4E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemBaseWidget*                   ItemInfo_PreviewedItem;                            // 0x4E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_PreviousSet;                                // 0x4F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_NextSet;                                    // 0x4F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetDetails* GetDefaultObj();

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);
};

// 0x68 (0x568 - 0x500)
// Class FortniteUI.AthenaChallengeSetDetails_Missions
class UAthenaChallengeSetDetails_Missions : public UAthenaChallengeSetDetails
{
public:
	int32                                        CurrentBundleItemLevel;                            // 0x500(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  PrestigeShimmerParamName;                          // 0x504(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ContextColorParamName;                             // 0x50C(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14C2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   NextRewardInputAction;                             // 0x518(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   PrevRewardInputAction;                             // 0x528(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	class UAthenaChallengeDetailRewardTrack*     ChallengeDetails_Rewards;                          // 0x538(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_LevelUpBundle;                              // 0x540(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              PrestiegeUpsell;                                   // 0x548(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_ProgressDisplay;                          // 0x550(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_MissionIcon;                              // 0x558(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_BundleState;                              // 0x560(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetDetails_Missions* GetDefaultObj();

	void VeiwingBundleLevelChanged();
	void UpdateLevelUpBundleButtonText();
	void OnBundlePrestiged();
	bool IsUrgentMission();
	bool IsCurrentlyViewPrestige();
	void HidePriestigeInfo(bool bHidePriestigeUpsell);
	void HandlePrevRewardAction(bool* bPassThrough);
	void HandleNextRewardAction(bool* bPassThrough);
	void HandleChallengesChanged();
	void HandleBundleLevelUpClicked();
	TSoftObjectPtr<class UTexture2D> GetChaseRewardForBundleLevel(int32 BundleLevel);
	void ChangeCurrentBundleLevel(int32 MovementDirection);
	bool CanLevelBundle();
	bool BundleHasMultipleLevels();
};

// 0x80 (0x508 - 0x488)
// Class FortniteUI.AthenaChallengeSetImageGrid
class UAthenaChallengeSetImageGrid : public UAthenaChallengeSetBaseDetails
{
public:
	uint8                                        Pad_14CD[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_ChallengeContext;                             // 0x4B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeSetName;                             // 0x4C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_Completion;                      // 0x4C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0x4D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                       SwipePanel_ChangeSet;                              // 0x4D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeListEntry_CompletionReward* CompletionReward_Entry;                            // 0x4E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeSetListView*           ChallengeDetail_List;                              // 0x4E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeDetailImageGrid*       ChallengeDetail_ImageGrid;                         // 0x4F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_PreviousSet;                                // 0x4F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_NextSet;                                    // 0x500(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetImageGrid* GetDefaultObj();

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);
	void ApplyNextSort();
};

// 0x58 (0x340 - 0x2E8)
// Class FortniteUI.AthenaChallengeSetListView
class UAthenaChallengeSetListView : public UAthenaChallengeListViewBase
{
public:
	struct FAthenaChallengeListVisualOptions     ListVisualOptions;                                 // 0x2E8(0xC)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bHideHeaders;                                      // 0x2F4(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHideCompletionRewards;                            // 0x2F5(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHideQuestRewards;                                 // 0x2F6(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseCompactActionInfo;                             // 0x2F7(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowFocus;                                       // 0x2F8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14D1[0x2F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaChallengeListEntry_Header> SectionHeaderEntryClass;                           // 0x328(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaChallengeListEntry_CompletionReward> CompletionRewardEntryClass;                        // 0x330(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaChallengeListEntry_StoreOffer> SpecialOfferEntryClass;                            // 0x338(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetListView* GetDefaultObj();

};

// 0x18 (0xB58 - 0xB40)
// Class FortniteUI.AthenaChallengeScreenTileBase
class UAthenaChallengeScreenTileBase : public UCommonButton
{
public:
	class UCommonTextBlock*                      Text_ChallengeName;                                // 0xB40(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLazyImage*                        LazyImage_RewardPreview;                           // 0xB48(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14D6[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeScreenTileBase* GetDefaultObj();

	void ResetToLocked();
	void OnContainsPartyAssistedChallengeChanged(bool bHasPartyAssistedChallenge);
	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete, bool bIsLocked);
};

// 0x8 (0x238 - 0x230)
// Class FortniteUI.AthenaMinimalChallengeInfoEntry
class UAthenaMinimalChallengeInfoEntry : public UCommonUserWidget
{
public:
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesComplete;              // 0x230(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMinimalChallengeInfoEntry* GetDefaultObj();

	void OnChallengeInfoSet(bool bIsInProgress);
};

// 0x10 (0xB68 - 0xB58)
// Class FortniteUI.AthenaChallengeScreenTile_Daily
class UAthenaChallengeScreenTile_Daily : public UAthenaChallengeScreenTileBase
{
public:
	class UImage*                                Image_PartyAssist;                                 // 0xB58(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_MinimalInfoDailies;                       // 0xB60(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeScreenTile_Daily* GetDefaultObj();

};

// 0x30 (0xB88 - 0xB58)
// Class FortniteUI.AthenaChallengeSetTile
class UAthenaChallengeSetTile : public UAthenaChallengeScreenTileBase
{
public:
	uint8                                        Pad_14DE[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaChallengeProgressBar*           ChallengeProgress_QuestsCompleted;                 // 0xB68(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_ChallengeContext;                             // 0xB70(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLazyImage*                        LazyImage_CustomBackground;                        // 0xB78(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                  RichText_UnavailableReason;                        // 0xB80(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile* GetDefaultObj();

};

// 0x8 (0xB90 - 0xB88)
// Class FortniteUI.AthenaChallengeSetTile_Event
class UAthenaChallengeSetTile_Event : public UAthenaChallengeSetTile
{
public:
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0xB88(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Event* GetDefaultObj();

};

// 0x0 (0xB88 - 0xB88)
// Class FortniteUI.AthenaChallengeSetTile_Weekly
class UAthenaChallengeSetTile_Weekly : public UAthenaChallengeSetTile
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Weekly* GetDefaultObj();

};

// 0x58 (0xBE0 - 0xB88)
// Class FortniteUI.AthenaChallengeSetTile_Mission
class UAthenaChallengeSetTile_Mission : public UAthenaChallengeSetTile
{
public:
	int32                                        BundleLevel;                                       // 0xB88(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        BundleLevelCompletionPercent;                      // 0xB8C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  PrestigeShimmerParamName;                          // 0xB90(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ContextColorParamName;                             // 0xB98(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14E4[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_MissionCompleted;                            // 0xBA8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ChaseReward;                                 // 0xBB0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  Text_AvailableInTime;                              // 0xBB8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0xBC0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_LockReason;                               // 0xBC8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_MissionIcon;                              // 0xBD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_Reward;                                   // 0xBD8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Mission* GetDefaultObj();

	bool IsUrgentMission();
	bool IsLockedByTime();
	TSoftObjectPtr<class UTexture2D> GetSoftTextureForChaseReward();
	bool CanLevelUpBundle();
};

// 0x0 (0xB88 - 0xB88)
// Class FortniteUI.AthenaChallengeSetTile_Style
class UAthenaChallengeSetTile_Style : public UAthenaChallengeSetTile
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Style* GetDefaultObj();

};

// 0x78 (0x360 - 0x2E8)
// Class FortniteUI.AthenaChallengeTreeView
class UAthenaChallengeTreeView : public UAthenaChallengeListViewBase
{
public:
	uint8                                        Pad_14E9[0x70];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaChallengeTreeEntry_ChallengeSet> SetHeaderEntryClass;                               // 0x358(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeTreeView* GetDefaultObj();

	void HandleQuestsUpdated();
};

// 0x220 (0x488 - 0x268)
// Class FortniteUI.AthenaCompassBase
class UAthenaCompassBase : public UFortHUDElementWidget
{
public:
	class UMaterialInstanceDynamic*              CompassMaterial;                                   // 0x268(0x8)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           MarkerBrush;                                       // 0x270(0x88)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           HeadingIndicatorBrush;                             // 0x2F8(0x88)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           StormIndicatorBrush;                               // 0x380(0x88)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        MarkerVerticalOffset;                              // 0x408(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14EB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaPlayerViewModel*                VM;                                                // 0x410(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                        HeadingFont;                                       // 0x418(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14ED[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCompassBase* GetDefaultObj();

	void BindToModel(class UAthenaPlayerViewModel* ViewModel);
};

// 0x60 (0x290 - 0x230)
// Class FortniteUI.AthenaCosmeticUnlockingInfo
class UAthenaCosmeticUnlockingInfo : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                  RichText_StaticUnlockingText;                      // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_UnlockingText;                            // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UProgressBar*                          ProgressBar_StepsCompleted;                        // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ProgressCompletion;                       // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                EmphasisStyle;                                     // 0x250(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                ProgressCompletionNumericStyle;                    // 0x260(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticItemDefinition*         CosmeticItemDef;                                   // 0x270(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_14FB[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCosmeticUnlockingInfo* GetDefaultObj();

	void ShowUnlockingInfoForCosmeticVariant(class UAthenaCosmeticItemDefinition* InCosmeticItemDef, struct FGameplayTag& InVariantChannel, struct FGameplayTag& InVariant);
	void ShowUnlockingInfoForCosmetic(class UAthenaCosmeticItemDefinition* InCosmeticItemDef);
	void ShowUnlockingInfo(class UFortItemDefinition* UnlockItem);
	void ShowSeasonUnlockingInfo(int32 SeasonNumber, int32 TierNumber);
	void RequestUpdateAnim();
	void RequestOutroAnim();
	void RequestIntroAnim();
	void OutroAnimFinished();
	void OnUnlockingInfoSet(bool bShowProgression);
	void HideUnlockingInfo();
};

// 0x0 (0x268 - 0x268)
// Class FortniteUI.AthenaCountdownWidgetBase
class UAthenaCountdownWidgetBase : public UFortHUDElementWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaCountdownWidgetBase* GetDefaultObj();

	void OnDisplayWarningMessage(class FText& FirstLineText, class FText& SecondLineText);
	void OnCountdownUpdate(int32 TimeRemaining, class FText& CountdownUpdateText);
	void OnCountdownStarted(int32 TimeRemaining, class FText& CountdownIntroText);
	void OnCountdownFinished();
	void HandleGamePhaseStepChanged(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
	void HandleCountdownStarted(int32 TimeRemaining);
	void HandleCountdownFinished();
};

// 0x120 (0x148 - 0x28)
// Class FortniteUI.AthenaCreativeItemEntryObjectWrapper
class UAthenaCreativeItemEntryObjectWrapper : public UObject
{
public:
	struct FFortItemEntry                        ItemEntry;                                         // 0x28(0x120)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaCreativeItemEntryObjectWrapper* GetDefaultObj();

};

// 0x138 (0xC78 - 0xB40)
// Class FortniteUI.AthenaCreativeItemTileButton
class UAthenaCreativeItemTileButton : public UCommonButton
{
public:
	uint8                                        Pad_150E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaCreativeItemTileView*           ParentView;                                        // 0xB48(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                   ItemDefinition;                                    // 0xB50(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortItemEntry                        ItemEntry;                                         // 0xB58(0x120)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCreativeItemTileButton* GetDefaultObj();

	void OnLoadedItem();
	void OnEntryClick(class UAthenaCreativeItemTileButton* Entry);
	class UAthenaCreativeItemEntryObjectWrapper* MakeFortItemEntryObjectWrapper(class UObject* Target, struct FFortItemEntry& InItemEntry);
	int32 GetItemTypeCount();
	bool CompareToItemEntry(struct FFortItemEntry& InItemEntry);
};

// 0x18 (0x388 - 0x370)
// Class FortniteUI.AthenaCreativeItemTileView
class UAthenaCreativeItemTileView : public UCommonTileView
{
public:
	class UFortOptionsTab*                       ParentTab;                                         // 0x370(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             CurrentlyFocusedItem;                              // 0x378(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1514[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCreativeItemTileView* GetDefaultObj();

};

// 0xD0 (0x300 - 0x230)
// Class FortniteUI.FortItemPickerBase
class UFortItemPickerBase : public UCommonUserWidget
{
public:
	UMulticastInlineDelegateProperty_            OnSelectionChangedEvent;                           // 0x230(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSelectionCommittedEvent;                         // 0x240(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnItemClicked;                                     // 0x250(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnItemClickedDoubleClicked;                        // 0x260(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnItemHoveredEvent;                                // 0x270(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnItemUnhovered;                                   // 0x280(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortItemTileView*                     PickerTileView;                                    // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UListView*                             ItemListViewWidget;                                // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1524[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bConfirmSelectionIfAlreadySelectedAfterOneClick;   // 0x2B0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1525[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               NewlySelectedItem;                                 // 0x2B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0x2C0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1527[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortItemPickerBase* GetDefaultObj();

	bool TryCommitSelectedItem();
	void SetSelectedItem(class UFortItem* ItemToSelect);
	bool SetSelectedIndex(int32 Index);
	void OnItemSelectionEvent__DelegateSignature(class UFortItem* SelectedItem);
	class UFortItem* GetSelectedItem();
	TScriptInterface<class IFortItemListViewInterface> GetListViewInterface();
	int32 GetIndexForItem(class UFortItem* Item);
	void ClearSelection();
	void CenterSelectedItemTileWidget();
	bool CanItemBeComitted(class UFortItem* ItemToCommit);
};

// 0x98 (0x398 - 0x300)
// Class FortniteUI.AthenaCustomizationPicker
class UAthenaCustomizationPicker : public UFortItemPickerBase
{
public:
	UMulticastInlineDelegateProperty_            OnCosmeticSelectionSaving;                         // 0x300(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnCosmeticSelectionSaved;                          // 0x310(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnShowSaveButton;                                  // 0x320(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnHideSaveButton;                                  // 0x330(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonButton>             FilterTabButtonType;                               // 0x340(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonButtonStyle>        FilterTabButtonStyle;                              // 0x348(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortAthenaItemManagementInventoryFilterTabLabelInfo> FilterTabLabelInfoArray;                           // 0x350(0x10)(Edit, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UFortTabListWidgetBase*                FilterTabList;                                     // 0x360(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  CurrentFilterName;                                 // 0x368(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x370(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_153F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0x374(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowUnownedItems;                                // 0x378(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowCommits;                                     // 0x379(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bOneItemPerSlot;                                   // 0x37A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1540[0x15];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             ItemListeningTo;                                   // 0x390(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationPicker* GetDefaultObj();

	void SetFilter(class FName FilterName);
	void RefreshView(bool CategoryChanging, bool FilterChanged);
	void OnUpdateSaveButtonVisuals__DelegateSignature();
	void OnNoItemsAvailableInFilter(class FText& EmptyDisplayText);
	void OnItemsAvailableInFilter();
	void OnCosmeticChangeSaveEvent__DelegateSignature();
	void HandleSelectedItemHasChanged(bool ItemChanged, bool AmmoChanged, bool IngredientsChanged);
	void HandleFilterTabSelected(class FName TabNameID);
	void HandleFilterTabButtonCreated(class FName TabNameID, class UCommonButton* TabButton);
	void HandleDifferentFilterSetBP();
	class FText GetQualifiedFilterDisplayName(enum class EAthenaFilterDisplayType InTopFilterDisplaySetting);
	void EndCustomizationCategory();
	void BeginCustomizationCategory(enum class EAthenaCustomizationCategory Category, int32 SubslotToEdit, bool bInAllowUnownedItems, bool bInOneItemPerSlot);
};

// 0x38 (0xB78 - 0xB40)
// Class FortniteUI.FortItemTileButton
class UFortItemTileButton : public UCommonButton
{
public:
	uint8                                        Pad_1543[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortMultiSizeItemCard*                ItemWidget;                                        // 0xB50(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>              Item;                                              // 0xB58(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemCardSize                 ItemCardSize;                                      // 0xB60(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsRewardCard;                                      // 0xB61(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1547[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0xB68(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortItemTileButton* GetDefaultObj();

	void OnTileSizeOverrideCheck(enum class EFortItemType TypeIn, enum class EFortItemCardSize SizeIn, enum class EFortItemCardSize* SizeOut);
};

// 0x10 (0xB88 - 0xB78)
// Class FortniteUI.AthenaCustomizationPickerTileButton
class UAthenaCustomizationPickerTileButton : public UFortItemTileButton
{
public:
	uint8                                        Pad_154E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortBangWrapper_NUI*                  Bang;                                              // 0xB80(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationPickerTileButton* GetDefaultObj();

	void OnEquippedStateChanged(bool bEquipped, bool bOnDifferentSlot);
	void OnChangeOwnedState(bool bOwned);
};

// 0x3A8 (0x810 - 0x468)
// Class FortniteUI.AthenaCustomizationScreenBase
class UAthenaCustomizationScreenBase : public UFortActivatablePanelWithItemPreview
{
public:
	class FText                                  CategoryDisplayNames[0x13];                        // 0x468(0x1C8)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  ItemTypeDisplayNames[0x13];                        // 0x630(0x1C8)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1556[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        LastProfileRev;                                    // 0x808(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCustomizationScreenBase* GetDefaultObj();

	void ShiftItemsVariantOption(class UAthenaCosmeticAccountItem* Item, int32 VariantChannelIndex);
	void ProcessLoadoutChanged();
	void HandleLoadoutChanged();
	void HandleInventoryUpdated(TSet<class FString>& ItemChangeFlags, int64 ProfileRevision);
	class FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory);
	class UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);
	class FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory);
};

// 0x30 (0xB70 - 0xB40)
// Class FortniteUI.AthenaCustomizationSlotSelectorButton
class UAthenaCustomizationSlotSelectorButton : public UCommonButton
{
public:
	enum class EAthenaCustomizationCategory      CustomizationType;                                 // 0xB40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_156C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0xB44(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMultiSizeItemCard*                ItemWidget;                                        // 0xB48(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          RequiredSlotGameplayTag;                           // 0xB50(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_156F[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCustomizationSlotSelectorButton* GetDefaultObj();

	void SetCustomizationType(enum class EAthenaCustomizationCategory NewType, int32 InSubslotIndex, struct FGameplayTag& RequiredSlotTag);
	void OnCustomizationSlotActiveStateChanged(bool bInAttachableCosmeticAvailable, bool bInActive);
	bool IsSlotFilled();
	void GetCustomizationSlotActiveState(bool* bOutAttachableCosmeticAvailable, bool* bOutActive);
};

// 0x0 (0x228 - 0x228)
// Class FortniteUI.AthenaEliminationOverlayBase
class UAthenaEliminationOverlayBase : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaEliminationOverlayBase* GetDefaultObj();

};

// 0x1C8 (0x430 - 0x268)
// Class FortniteUI.BacchusHUDElement
class UBacchusHUDElement : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_157F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsInLayoutMode;                                   // 0x270(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1580[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          VisualType;                                        // 0x274(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1581[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  WidgetName;                                        // 0x280(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bHideWhenNotUsingTouch;                            // 0x298(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAlwaysShow;                                       // 0x299(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBuildMode;                                     // 0x29A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCombatMode;                                    // 0x29B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInEditMode;                                      // 0x29C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCreativeMode;                                  // 0x29D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsFreeFalling;                                     // 0x29E(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsGliding;                                         // 0x29F(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              CanOpenChute;                                      // 0x2A0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InLockedBus;                                       // 0x2A1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InUnlockedBus;                                     // 0x2A2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnTargeting;                                       // 0x2A3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnUsingScopeTargeting;                             // 0x2A4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanTarget;                                       // 0x2A5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseScopeTargeting;                            // 0x2A6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCrouching;                                       // 0x2A7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseSecondaryAbility;                          // 0x2A8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDBNO;                                            // 0x2A9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnControllingRCPawn;                               // 0x2AA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInVehicle;                                       // 0x2AB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDrivingVehicle;                                  // 0x2AC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1584[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHUDLayoutDataEntry                   DefaultEntry;                                      // 0x2B0(0x180)(Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBacchusHUDElement* GetDefaultObj();

	void ShowHighlight(bool Show);
	void OnHUDStateUpdate(struct FFortHUDState& NewState);
	void HandleShowButtonHightlight(struct FGameplayTagContainer& HUDGameplayTags, bool Show);
	void HandleInputMethodChanged(enum class ECommonInputType CurrentInputType);
	struct FGameplayTag BP_GetMobileVisualType();
};

// 0x20 (0x450 - 0x430)
// Class FortniteUI.AthenaEquippedItemBase
class UAthenaEquippedItemBase : public UBacchusHUDElement
{
public:
	enum class EEquippedWeaponDisplay            CurrentMode;                                       // 0x430(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1594[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaPlayerViewModel*                VM;                                                // 0x438(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1595[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEquippedItemBase* GetDefaultObj();

	void WeaponTypeChanged(enum class EEquippedWeaponDisplay Mode);
	void UtilityItemTypeChanged(class AFortWeapon* Weapon, class UFortWeaponItemDefinition* Item);
	void UtilityItemCountChanged(int32 Remaining);
	void SetViewModel(class UAthenaPlayerViewModel* ViewModel);
	void ResourceTypeChanged(class UFortResourceItemDefinition* Item, int32 ResourceCount);
	void ResourceCountChanged(int32 ResourceCount);
	void OnWorldItemsChanged();
	void OnWeaponChanged(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnViewTargetChanged();
	void OnLocalAmmoChanged(int32 LocalCount, int32 LocalRemaining);
	void OnBuildingMaterialChanged();
	void HasAmmoChanged(bool bHasAmmo);
	void AmmoTypeChanged(class AFortWeaponRanged* RangedWeapon, class UFortWorldItemDefinition* Item);
	void AmmoChanged(int32 MagazineAmmoCount, int32 BackupAmmoCount, int32 TotalRemaining);
};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.AthenaEventGamesBase
class UAthenaEventGamesBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventGamesBase* GetDefaultObj();

};

// 0x28 (0x368 - 0x340)
// Class FortniteUI.AthenaEventMatchActiveGridScreenBase
class UAthenaEventMatchActiveGridScreenBase : public UAthenaEventScreenBase
{
public:
	TSubclassOf<class UAthenaEventMatchTeamWidgetBase> TeamWidgetClass;                                   // 0x340(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaEventMatchTeamWidgetBase*> ActiveTeams;                                       // 0x348(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                        MaxNumColumns;                                     // 0x358(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamCount;                                      // 0x35C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamSize;                                       // 0x360(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1598[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchActiveGridScreenBase* GetDefaultObj();

	void OnTeamEliminated_BP();
	void OnTeamEliminated(int32 InSquadId);
	void OnTeamChanged_BP();
};

// 0x28 (0x368 - 0x340)
// Class FortniteUI.AthenaEventMatchEliminatedGridScreenBase
class UAthenaEventMatchEliminatedGridScreenBase : public UAthenaEventScreenBase
{
public:
	TSubclassOf<class UAthenaEventMatchTeamWidgetBase> TeamWidgetClass;                                   // 0x340(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaEventMatchTeamWidgetBase*> EliminatedTeams;                                   // 0x348(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                        MaxNumColumns;                                     // 0x358(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamCount;                                      // 0x35C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamSize;                                       // 0x360(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_159C[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchEliminatedGridScreenBase* GetDefaultObj();

	void OnTeamEliminated_BP();
	void OnPlayerEliminatedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsEliminated);
};

// 0x10 (0xB50 - 0xB40)
// Class FortniteUI.AthenaEventMatchPlayerWidgetBase
class UAthenaEventMatchPlayerWidgetBase : public UCommonButton
{
public:
	uint8                                        Pad_15CF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UAthenaRemotePlayerViewData> PlayerData;                                        // 0xB48(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaEventMatchPlayerWidgetBase* GetDefaultObj();

	void SetPlayerData(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnTeamColorChanged(class UAthenaRemotePlayerViewData* InPlayerData, const struct FLinearColor& InTeamColor);
	void OnSquadIdChanged(class UAthenaRemotePlayerViewData* InPlayerData, uint8 InSquadId);
	void OnShieldHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax);
	void OnShieldDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax);
	void OnPlayerStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerStateAthena* InPlayerState);
	void OnPlayerPawnChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerPawn* InPlayerPawn);
	void OnPlayerNameChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InPlayerName);
	void OnPlayerDataChanged(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnPlaceChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InPlace);
	void OnMaterialCountChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InCount);
	void OnLocationChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InLocation);
	void OnKillScoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InKillScore);
	void OnIsReplayRelevancyPlayerChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsReplayRelevancyPlayer);
	void OnIsInRelevancyChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsInRelevancy);
	void OnIsFollowedPlayerChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsFollowedPlayer);
	void OnHealthHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax);
	void OnHealthDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax);
	void OnDisconnectedChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDisconnected);
	void OnDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDead);
	void OnDBNOStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDBNO);
	void OnBeingRevivedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsBeingRevived);
};

// 0x0 (0xB50 - 0xB50)
// Class FortniteUI.AthenaEventMatchScoreboardPlayerWidgetBase
class UAthenaEventMatchScoreboardPlayerWidgetBase : public UAthenaEventMatchPlayerWidgetBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventMatchScoreboardPlayerWidgetBase* GetDefaultObj();

	void SetSquadIdVisible(bool InVisible);
};

// 0x40 (0x380 - 0x340)
// Class FortniteUI.AthenaEventMatchScoreboardScreenBase
class UAthenaEventMatchScoreboardScreenBase : public UAthenaEventScreenBase
{
public:
	class UCommonListView*                       ScoreboardListView;                                // 0x340(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   SortByEliminationsActionRowHandle;                 // 0x348(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   SortByPlaceActionRowHandle;                        // 0x358(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UAthenaRemoteSquadViewData*>    SquadDataArray;                                    // 0x368(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_15D9[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchScoreboardScreenBase* GetDefaultObj();

	void SetSquadIdsVisible_BP(bool bSquadIdsVisible);
	void SetSquadIdsVisible(bool bSquadIdsVisible);
	void OnSquadKillscoreChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InKillScore);
	void OnSquadEliminated(class UAthenaRemoteSquadViewData* InSquadData);
	void OnSortByPlaceActionExecuted(bool* bPassThrough);
	void OnSortByEliminationsActionExecuted(bool* bPassThrough);
};

// 0x8 (0x278 - 0x270)
// Class FortniteUI.AthenaEventMatchScoreboardSquadWidget
class UAthenaEventMatchScoreboardSquadWidget : public UAthenaEventMatchSquadWidgetBase
{
public:
	uint8                                        Pad_15DA[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchScoreboardSquadWidget* GetDefaultObj();

};

// 0x50 (0x390 - 0x340)
// Class FortniteUI.AthenaEventMatchStatusScreenBase
class UAthenaEventMatchStatusScreenBase : public UAthenaEventScreenBase
{
public:
	uint8                                        Pad_15F0[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchStatusScreenBase* GetDefaultObj();

	void UpdateTimeSinceLastKillText(class FText& TimeSinceLastKillText);
	void UpdateSupplyDropsLootedText(class FText& SupplyDropsLootedText);
	void UpdateShotsFiredText(class FText& ShotsFiredText);
	void UpdatePlayersRemainingText(class FText& PlayersRemainingText);
	void UpdatePiecesDestroyedText(class FText& PiecesDestroyedText);
	void UpdatePiecesBuiltText(class FText& PiecesBuiltText);
	void UpdateMostKillsText(class FText& MostKillsText);
	void UpdateMostKillsScore(class FText& MostKillsScore);
	void UpdateMatchTimeText(class FText& MatchTimeText);
	void UpdateLongestEliminationText(class FText& LongestEliminationText);
	void UpdateLongestEliminationScore(class FText& LongestEliminationScore);
	void UpdateGamePhaseTimeTitleText(class FText& GamePhaseTimeTitleText);
	void UpdateGamePhaseTimeText(class FText& GamePhaseTimeText);
	void UpdateGamePhaseText(class FText& GamePhaseText);
	void UpdateFastestKillText(class FText& FastestKillText, class FText& FastestKillTime);
	void UpdateDamageTakenText(class FText& DamageTakenText);
	void UpdateDamageInflictedText(class FText& DamageInflictedText);
	void UpdateDamageHealedText(class FText& DamageHealedText);
	void UpdateCircleRadiusText(class FText& CircleRadiusText);
	void UpdateChestsLootedText(class FText& ChestsLootedText);
	void OnPlayerKillScoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InKillScore);
	void OnPlayerDeadStateChanged_BP(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead);
	void OnPlayerDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead);
};

// 0x60 (0x290 - 0x230)
// Class FortniteUI.AthenaEventMatchTeamWidgetBase
class UAthenaEventMatchTeamWidgetBase : public UCommonUserWidget
{
public:
	TArray<class UAthenaEventMatchPlayerWidgetBase*> PlayerWidgets;                                     // 0x230(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        SquadId;                                           // 0x240(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15F4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          TeamColor;                                         // 0x244(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxTeamSize;                                       // 0x254(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAthenaEventMatchPlayerWidgetBase> PlayerWidgetClass;                                 // 0x258(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15F5[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class UAthenaRemotePlayerViewData>> PlayerDatas;                                       // 0x278(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_15F6[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchTeamWidgetBase* GetDefaultObj();

	void OnPlayerWidgetAdded();
	void OnPlayerDisconnectedChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDisconnected);
	void OnPlayerDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead);
	bool IsTeamDead();
	int32 GetTeamKills();
};

// 0x20 (0x250 - 0x230)
// Class FortniteUI.AthenaFPSBase
class UAthenaFPSBase : public UCommonUserWidget
{
public:
	class UTextBlock*                            FPS;                                               // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15F7[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaFPSBase* GetDefaultObj();

};

// 0x28 (0x258 - 0x230)
// Class FortniteUI.AthenaGadgetFuelWidget
class UAthenaGadgetFuelWidget : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class UAthenaGadgetItemDefinition> AthenaGadgetItemDefinition;                        // 0x230(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EFortFuelGadgetVisualType         FortFuelGadgetVisualType;                          // 0x238(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_15F9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                FuelGaugeProgressImage;                            // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonNumericTextBlock*               CurrentChargesText;                                // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_15FA[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGadgetFuelWidget* GetDefaultObj();

	void SetItem(class UFortWorldItem* Item);
};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.AthenaGameOverDisplay
class UAthenaGameOverDisplay : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaGameOverDisplay* GetDefaultObj();

};

// 0x8 (0x348 - 0x340)
// Class FortniteUI.AthenaGameOverScreenBase
class UAthenaGameOverScreenBase : public UFortActivatablePanel
{
public:
	uint8                                        Pad_15FB[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGameOverScreenBase* GetDefaultObj();

	void RequestRefreshInput();
	void GoToBoss();
	bool CanShowGoToBoss();
};

// 0x20 (0x288 - 0x268)
// Class FortniteUI.AthenaGenericHUDTimerWidgetBase
class UAthenaGenericHUDTimerWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_15FE[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UTextBlock*                            TimeText;                                          // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15FF[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGenericHUDTimerWidgetBase* GetDefaultObj();

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
};

// 0x260 (0x290 - 0x30)
// Class FortniteUI.AthenaHUDContext
class UAthenaHUDContext : public UBlueprintContextBase
{
public:
	uint8                                        Pad_1696[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastInlineDelegateProperty_            OnLocalPlayerWon;                                  // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalPlayerDeathOnWin;                           // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalTeamWon;                                    // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalTeamLost;                                   // 0x68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalPlayerLost;                                 // 0x78(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalPlayerKilledPlayer;                         // 0x88(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalPlayerDBNOStateChanged;                     // 0x98(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnUIGameplayCue;                                   // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalPlayerBeginSkydiving;                       // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnAthenaAutoFireChanged;                           // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnClientSettingsShowViewersChanged;                // 0xD8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnAthenaGamePhaseChanged;                          // 0xE8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnPlayerFiredWeapon;                               // 0xF8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLowPerformanceMode;                              // 0x108(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnPTTStateChange;                                  // 0x118(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnCanPTTChange;                                    // 0x128(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            ShowMobilePickerDelegate;                          // 0x138(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnPlaylistUIExtensionChanged;                      // 0x148(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnPlayerNameChangeDelegate;                        // 0x158(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnResurrectingNowDelegate;                         // 0x168(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnAllWinnersAnnouncedDelegate;                     // 0x178(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSignalQualityChangeDelegate;                     // 0x188(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnForwardStartedFalling;                           // 0x198(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSpecialActorListChanged;                         // 0x1A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_169E[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastInlineDelegateProperty_            OnInventoryItemSelected;                           // 0x1C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnInventorySwapStarted;                            // 0x1D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnInventorySwapComplete;                           // 0x1E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnFireStopped;                                     // 0x1F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UWidget>                MoveButtonWidgetPtr;                               // 0x208(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAthenaWinnerInfo                     WinnerInfo;                                        // 0x210(0x20)(NativeAccessSpecifierPrivate)
	bool                                         bMoveButtonMode;                                   // 0x230(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bPendingAttachToHUD;                               // 0x231(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_169F[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortGameUIExtenderAthena*             PlaylistUIExtender;                                // 0x238(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bLocalPlayerWonMatch;                              // 0x240(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16A1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UFortItem>              LastSelectedInventoryItem;                         // 0x244(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16A2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerPawnAthena*                 BoundPlayerPawn;                                   // 0x250(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16A3[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaHUDContext* GetDefaultObj();

	float VictoryStingerTimeUntilFadeOut();
	bool UseTapToShoot();
	void UseOrRleoadFromHUDStop();
	void UseOrRleoadFromHUDStart();
	void UpdateSelectedWidgetMoveOffsetVector(struct FVector2D& VectorOffset, float FMoveScale);
	void TakeMovementInputFromHUD(const struct FVector2D& MoveVector);
	void TakeLookStickInputFromHUD(const struct FVector2D& LookStickPosition);
	void TakeLookInputFromHUD(const struct FRotator& LookRotator);
	void TakeItemSelectionInputFromHUD(int32 TouchIndex, int32 SlotIdx, bool* bIsUsing, enum class EFortQuickBars InQuickBar, bool bReloadOrUseIfAlreadySelected, bool bStopUseImmediately);
	void SwapQuickBarFocusFromHUD(enum class EFortQuickBars InQuickBar, int32 SlotOverride);
	void StopTargettingFromHUD();
	void StopItemSelectionInputFromHUD(int32 TouchIndex, int32 SlotIdx, enum class EFortQuickBars InQuickBar);
	void StartOrFinishSwap(int32 SlotIndex);
	void ShowMobilePicker__DelegateSignature();
	void ShowMobilePicker();
	void ShowGameModeMessage();
	bool ShouldVictoryUIPushEmoteInput();
	bool ShouldPlayCustomEndScreenAtLoss();
	bool ShouldDisplayScoreUI();
	bool ShouldDisplayPlacement();
	void SetTargetingToggleable(bool bNewValue);
	void SetSelectWidgetToMoveMode(bool bSet);
	void SetSelectedInventoryItem(class UFortItem* Item);
	void SetResourceMaterial(enum class EFortResourceType NewMaterial);
	void SetPTTState(enum class EPTTState NewPushToTalkState);
	void SetLockOnStickCoords(struct FVector2D& LockOnCoords);
	void SetLocalPlayerWonMatch(bool bLocalPlayerWon);
	void SelectWidgetToMove(class UWidget* Widget);
	void ReloadFromHUD();
	void PushGameOverEmoteInput();
	void PTTStateChange__DelegateSignature(enum class EPTTState NewPushToTalkState);
	void PlaylistUIExtensionChanged__DelegateSignature();
	bool OwnerOrWeaponHasTag(const struct FGameplayTag& InTag);
	void OnSpecialActorListChanged__DelegateSignature();
	void OnSignalQualityChange__DelegateSignature(float NewQuality);
	void OnResurrectingNow__DelegateSignature(bool bResurrectingNow);
	void OnPlayerNameChange__DelegateSignature(const class FString& NewName);
	void OnPlayerFiredWeapon__DelegateSignature();
	void OnLowPerformanceMode__DelegateSignature(bool bInLowPerformanceMode);
	void OnLocalTeamWon__DelegateSignature();
	void OnLocalTeamLost__DelegateSignature();
	void OnLocalPlayerWon__DelegateSignature();
	void OnLocalPlayerLost__DelegateSignature(enum class EEndOfMatchReason LostReason);
	void OnLocalPlayerKilledPlayer__DelegateSignature(class AFortPlayerStateAthena* Player);
	void OnLocalPlayerDeathOnWin__DelegateSignature();
	void OnLocalPlayerDBNOStateChanged__DelegateSignature(bool bIsDBNO);
	void OnLocalPlayerBeginSkydiving__DelegateSignature();
	void OnForwardStartedFalling__DelegateSignature();
	void OnFireStopped__DelegateSignature(int32 StopFireIndex);
	void OnClientSettingUpdatedShowViewers();
	void OnCanPTTChange__DelegateSignature();
	void OnAthenaSettingsApplied__DelegateSignature();
	void OnAthenaInventorySwapStarted__DelegateSignature(int32 SlotIndex);
	void OnAthenaInventorySwapComplete__DelegateSignature();
	void OnAthenaInventoryItemSelected__DelegateSignature(class UFortItem* Item);
	void OnAthenaHUDAllWinnersAnnounced__DelegateSignature(struct FAthenaWinnerInfo& WinnerInfo);
	void OnAthenaGamePhaseChanged__DelegateSignature(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep NewPhase);
	void OnAthenaAutoFireChanged__DelegateSignature(bool bEntering);
	void OnAllWinnersAnnounced();
	void JumpFromHudStart(int32 TouchIndex);
	void JumpFromHudEnd();
	bool IsVictoryUICinematic();
	bool IsUsingScope();
	bool IsTargeting();
	bool IsSwapping();
	bool IsShowViewerCountEnabled();
	bool IsRunningOnBattery();
	bool IsOperatingTurret();
	bool IsMovingSelectedWidget();
	bool IsInSelectWidgetToMoveMode();
	bool IsInBuildMode();
	bool IsFiringFromTouch(int32 TouchIndex);
	bool IsCurrentWeaponFiring();
	bool IsCurrentWeaponChargeable();
	bool IsCrouching();
	bool IsAutoRunEnabled();
	bool IsActionBound(class FName ActionName);
	void HideGameModeMessage();
	bool HasWifi();
	bool HasLockOnTarget();
	bool HasFiringTouch();
	bool HasAutofireTarget();
	void HandleUIGameplayCue(class FName CueName, enum class EGameplayCueEvent EventType, struct FGameplayCueParameters& Parameters);
	void HandleSpectatorViewTargetChanged();
	void HandleLocalPlayerDBNOStateChanged(class AFortPawn* FortPawn, bool bIsDBNO);
	void HandleLocalPlayerBeginSkydiving();
	void HandleGamePhaseChange(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void GetWinnerText(class FText* ReturnText, class FText& WinnerName);
	TSubclassOf<class UUserWidget> GetVictoryUIWidgetClass();
	class FText GetVictoryText();
	class USoundCue* GetVictoryStinger();
	int32 GetSquadConnectedCount();
	class UFortItem* GetSelectedInventoryItem();
	enum class EPTTState GetPTTState();
	class UFortGameUIExtenderAthena* GetPlaylistUIExtender();
	class FString GetPlayerName();
	struct FLinearColor GetPlayerColor();
	void GetLocalTime(int32* Hours, int32* Minutes);
	int32 GetJumpPressedTouchIndex();
	int32 GetInteractPressedTouchIndex();
	bool GetInLowPerformanceMode();
	class FText GetGliderDisplayName();
	float GetGameOverDelayTime();
	TSubclassOf<class UUserWidget> GetCustomDBNOWidgetClass();
	class UMaterialInterface* GetCustomDBNOReviveMaterial();
	class UAthenaPlayerViewModel* GetCurrentViewModel();
	bool GetCanPTT();
	TArray<class FName> GetBoundActions();
	float GetBatteryLevel();
	void ForwardOnSpecialActorListChanged(struct FSpecialActorRepData& SpecialActorData);
	void ForceFireFromHUDStop();
	void FireFromHUDStop(int32 TouchIndex, class UWidget* DebugWidget);
	void FireFromHUDStart(int32 TouchIndex, class UWidget* DebugWidget);
	void ExecuteActionNameFromHUDWithEventType(class FName ActionName, enum class EInputEvent KeyEvent);
	void ExecuteActionNameFromHUD(class FName ActionName);
	void EndUseFromHUD();
	void EnableAutoRunFromHUD(bool bEnable);
	float DisplayPlayerWonTime();
	void CycleQuickbar();
	bool CanShootInVehicle();
	bool CanCurrentWeaponAutoFireFromReticle();
	void CancelSwap();
	bool CanAutoRun();
	void BeginUseFromHUD();
};

// 0x8 (0x270 - 0x268)
// Class FortniteUI.AthenaHUDGamePhaseChangingBase
class UAthenaHUDGamePhaseChangingBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_16AC[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaHUDGamePhaseChangingBase* GetDefaultObj();

	void UpdateMessaging(enum class EAthenaGamePhaseStep Step, class FText& MESSAGE, class FText& TimeText);
	void HandleGamePhaseStepChanged(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void GamePhaseStepChanged(enum class EAthenaGamePhaseStep Step);
};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.AthenaHUDInputWidget
class UAthenaHUDInputWidget : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaHUDInputWidget* GetDefaultObj();

};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.AthenaHUDMenu
class UAthenaHUDMenu : public UCommonUserWidget
{
public:
	class UFortDualBladeMenu*                    DualBladeMenu;                                     // 0x230(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonUserWidget*                     BottomBar;                                         // 0x238(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaHUDMenu* GetDefaultObj();

	void ToggleBladeMenus();
	void DismissBladeMenus();
};

// 0x20 (0x288 - 0x268)
// Class FortniteUI.AthenaHUDPlayerActionAlertBase
class UAthenaHUDPlayerActionAlertBase : public UFortHUDElementWidget
{
public:
	TWeakObjectPtr<class AFortPlayerPawnAthena>  CurrentPlayerPawn;                                 // 0x268(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16B8[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaHUDPlayerActionAlertBase* GetDefaultObj();

	void RequestNextAlert();
	void ClearAlert();
	void AlertPlayer(enum class EAthenaPlayerActionAlert Alert, class FText& DetailText);
};

// 0x40 (0x2A8 - 0x268)
// Class FortniteUI.AthenaIndicatorLayerBase
class UAthenaIndicatorLayerBase : public UFortHUDElementWidget
{
public:
	class UFortActorCanvas*                      GeneralIndicators;                                 // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaPlayerIndicatorBase*>    PlayerIndicators;                                  // 0x270(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x280(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USlateVectorArtData*                   TeamIndicatorMesh;                                 // 0x288(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bWasTargeting;                                     // 0x290(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16C0[0x17];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaIndicatorLayerBase* GetDefaultObj();

	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	void PlayersWithNameIndicatorsChanged(TArray<class AFortPlayerStateAthena*>& PlayerStates);
	void OnTargetingChanged(bool bTargeting);
	class UAthenaPlayerViewModel* GetPlayerViewModel();
	TArray<class AFortPlayerStateAthena*> GetNameIndicatedPlayers();
};

// 0x18 (0xB58 - 0xB40)
// Class FortniteUI.AthenaInventoryEquipButtonBase
class UAthenaInventoryEquipButtonBase : public UCommonButton
{
public:
	class UFortMultiSizeItemCard*                ItemWidget;                                        // 0xB40(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               EmptyImage;                                        // 0xB48(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SlotIndex;                                         // 0xB50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16C2[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaInventoryEquipButtonBase* GetDefaultObj();

};

// 0x0 (0xB78 - 0xB78)
// Class FortniteUI.AthenaInventoryFortItemTileButtonBase
class UAthenaInventoryFortItemTileButtonBase : public UFortItemTileButton
{
public:

	static class UClass* StaticClass();
	static class UAthenaInventoryFortItemTileButtonBase* GetDefaultObj();

};

// 0x58 (0x398 - 0x340)
// Class FortniteUI.AthenaInventoryPanelBase
class UAthenaInventoryPanelBase : public UFortActivatablePanel
{
public:
	class UFortItemTileView*                     ResourceView;                                      // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemTileView*                     AmmoView;                                          // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroup*                    EquipButtonGroup;                                  // 0x350(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16C6[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaInventoryPanelBase* GetDefaultObj();

	void SetBypassNotifications(bool bBypass);
	void RequestEquip(class UFortItem* Item);
	void HandleQuickBarChangedBP(enum class EFortQuickBars QuickBarType);
	void HandleInventoryItemSelected(class UFortItem* Item);
	class UFortItemTileView* GetTileViewForItem(class UFortItem* Item);
	void FocusTileView(class UFortItemTileView* TileView);
	void AttemptToUpdateFocus();
	void AdvanceSelection(class UFortItemTileView* TileView);
};

// 0x180 (0x5E8 - 0x468)
// Class FortniteUI.AthenaItemSelectorScreenBase
class UAthenaItemSelectorScreenBase : public UFortActivatablePanelWithItemPreview
{
public:
	TSubclassOf<class UCommonButton>             TabButtonType;                                     // 0x468(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<enum class EAthenaCustomizationCategory, struct FFortTabButtonLabelInfo> ItemCategoryButtonLabelInfo;                       // 0x470(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FFortTabButtonLabelInfo               VariantButtonLabelInfo;                            // 0x4C0(0xA0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_ConfirmSelection;                           // 0x560(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_EditStyle;                                  // 0x568(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_ConfirmStyle;                               // 0x570(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCustomizationPicker*            Picker_ItemSelector;                               // 0x578(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                          ItemInfo;                                          // 0x580(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemBaseWidget*                   Item_HeaderInfo;                                   // 0x588(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItem*                             CurrentPreviewItem;                                // 0x590(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCosmeticItemDefinition*         CurrentPreviewItemDef;                             // 0x598(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMcpVariantChannelInfo>        CurrentPreviewVariantChannels;                     // 0x5A0(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UFortVariantPicker*                    Picker_VariantSelector;                            // 0x5B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticUnlockingInfo*          UnlockingInfo;                                     // 0x5B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16DA[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x5E0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16DB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0x5E4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaItemSelectorScreenBase* GetDefaultObj();

	void StartItemCustomization(struct FAthenaCustomizationParams& Params);
	void SaveAndExit_ApplyToAllSlots();
	void SaveAndExit(bool bApplyToAllSlots);
	void OnTabSelectionChanged(bool bShowingVariants);
	void OnSavingItemStarted();
	void OnItemSelectionCommited(class UFortItem* SelectedItem);
	void OnItemSelectedChanged(class UFortItem* SelectedItem);
	void OnFinsihedItemSave();
	void OnFinishedItemSetup(class FText& CategoryDisplayName, class FText& ItemDisplayTypeName, enum class EAthenaCustomizationCategory SelectedCategory, class UMaterialInstance* OverrideSlotImage);
	void OnCurrentItemChanged(class UFortItem* SelectedItem);
	bool IsItemOwned(class UFortItem* Item);
	void HandleSelectedTabChanged(class FName SelectedTabID);
	class UFortItem* GetCurrentItem();
	void ExitEditStyle();
	void EnterEditStyle();
};

// 0x100 (0x440 - 0x340)
// Class FortniteUI.AthenaLeaderboardScreenBase
class UAthenaLeaderboardScreenBase : public UFortActivatablePanel
{
public:
	class UFortTabListWidgetBase*                LeaderboardTabList;                                // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                        MatchRotator;                                      // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                        LeaderboardTypeRotator;                            // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      RefreshTimeText;                                   // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      NoDataMessageText;                                 // 0x360(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonBorder*                         BorderLocalUserFocus;                              // 0x368(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                            LeaderboardDisplayData;                            // 0x370(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UCommonButton*>      ActiveTabButtons;                                  // 0x378(0x50)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortLeaderboardRowProxyInstance*> RowProxies;                                        // 0x3C8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UFortLeaderboardRowProxyInstance*      LocalUserRowProxy;                                 // 0x3D8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLeaderboardFilter                    CurrentLeaderboardFilter;                          // 0x3E0(0x28)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_16E6[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLeaderboardScreenBase* GetDefaultObj();

	void OnUpdateTabButtonText(class UCommonButton* Button, struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateListHeader(struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateLeaderboardListUI(bool bWasSuccessful, class UFortLeaderboardRowProxyInstance* LocalUserRow, class FText& QueryErrorStr);
	void OnQueryStarted();
	void OnQueryFinished();
	void OnPlaylistChanged(class FName NewPlaylistName, enum class ECommonInputType NewInputType);
	void OnMatchTypeChanged(int32 MatchTypeIndex);
	void OnFriendsFilterChanged(int32 FriendsFilterIndex);
	void OnActiveLeaderboardTabChanged(int32 ActiveWidgetIndex);
	bool CanShowFriendsOnlyLeaderboard();
};

// 0x0 (0x2A0 - 0x2A0)
// Class FortniteUI.AthenaLevelBarBase
class UAthenaLevelBarBase : public UFortActorIndicatorWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaLevelBarBase* GetDefaultObj();

};

// 0x18 (0x358 - 0x340)
// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
class UAthenaLoadingScreenPreviewPanelBase : public UFortActivatablePanel
{
public:
	class UAthenaLoadingScreenItemDefinition*    MyLoadingScreen;                                   // 0x340(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNativeWidgetHost*                     LoadingScreenSlot;                                 // 0x348(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16EC[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLoadingScreenPreviewPanelBase* GetDefaultObj();

};

// 0x48 (0x388 - 0x340)
// Class FortniteUI.FortLobbyWidget
class UFortLobbyWidget : public UFortActivatablePanel
{
public:
	TArray<class AFortTeamMemberPedestal*>       VisualOrderedPedestals;                            // 0x340(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16F0[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortLobbyPlayerPanel*                 PlayerPanel_PlayerOptions;                         // 0x368(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortRadialPicker*                     Radial_EmotePicker;                                // 0x370(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   EmoteInputAction;                                  // 0x378(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortLobbyWidget* GetDefaultObj();

	void OnPlayerPanelHidden();
	void OnPlayerClicked();
	void HandleEmoteClicked(bool* bPassThrough);
	void DynamicHandleLoadingScreenVisibilityChanged(bool IsVisible);
};

// 0x160 (0x4E8 - 0x388)
// Class FortniteUI.AthenaLobbyBase
class UAthenaLobbyBase : public UFortLobbyWidget
{
public:
	uint8                                        Pad_16FB[0x19];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         ShownGlyphBundleUpdate;                            // 0x3A1(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsSwitchingLevels;                                // 0x3A2(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortLobbyType                    CurrentLobbyType;                                  // 0x3A3(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ActiveLobbyLevelName;                              // 0x3A4(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  LoadingLobbyLevelName;                             // 0x3AC(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  NextLobbyLevelName;                                // 0x3B4(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16FC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UFortAthenaNewsPanel>      NewsModalClass;                                    // 0x3C0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortSquadSelectionMenu>   SquadFormationClass;                               // 0x3C8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>               LiveStreamVideoClass;                              // 0x3D0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaMatchmakingWidget*          Matchmaking_Athena;                                // 0x3D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEmergencyNoticeBase*                  Notice_Emergency;                                  // 0x3E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonBorder*                         LobbyDetails_Default;                              // 0x3E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTournamentLobbyPanel*             LobbyDetails_Tournament;                           // 0x3F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDivisionLobbyPanel*               LobbyDetails_ShowdownDivision;                     // 0x3F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeInfoPanel*             ChallengeInfo_Widget;                              // 0x400(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaMissionInfoPanel*               MissionInfo_Widget;                                // 0x408(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 Switcher_LobbyDetailsMode;                         // 0x410(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_GenericLink;                                // 0x418(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ShadowPlayHighlights;                       // 0x420(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFriendCodeShareButtonBase*            Button_ShareFriendCode;                            // 0x428(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   SquadFormationInputAction;                         // 0x430(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   WatchLiveInputAction;                              // 0x440(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16FD[0x90];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCatalogMessaging*                     CatalogMessaging;                                  // 0x4E0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaLobbyBase* GetDefaultObj();

	void UpdateGenericLinkText(class FText& NewText);
	void ShowMobileAutoFireScreen();
	void ShowHighlightSummary();
	void OnUpdateSocialImportButtonText(class FText& NewText);
	void OnPlaylistChanged(enum class EFortLobbyType LobbyType, class UFortPlaylistAthena* PlaylistData);
	void OnLobbyChanged(enum class EFortLobbyType& LobbyType);
	void LoadLobbyBackground();
	void HandleWatchLiveStreamClicked(bool* bPassThrough);
	void HandleSquadFormationClicked(bool* bPassThrough);
	void HandlePlaylistDataChanged(struct FPlaylistData& NewPlaylistData);
	void HandleGenericLinkButtonClicked();
	void HandleActiveWidgetChanged(class UWidget* NewActiveWidget, int32 WidgetIndex);
	void DisplayStoreUpdated(class UStoreToastRequest* StoreUpdatedRequest);
	void DisplayGlyphQuestUpdated(int32 NewGlyphs);
};

// 0x68 (0x3A8 - 0x340)
// Class FortniteUI.FortLobbyPlayerPanel
class UFortLobbyPlayerPanel : public UFortActivatablePanel
{
public:
	TSubclassOf<class UFortTeamMemberManage>     ManageModalClass;                                  // 0x340(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1703[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButton*                         Button_AddFriend;                                  // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_InviteParty;                                // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Manage;                                     // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Close;                                      // 0x368(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPlayerBanner*                     Banner_Player;                                     // 0x370(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_PlayerName;                               // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                            Text_InviteSent;                                   // 0x380(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_PlatformIcon;                                // 0x388(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1704[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortLobbyPlayerPanel* GetDefaultObj();

	void OnFriendStatusUpdated(enum class EFortFriendRequestStatus FriendRequestStatus);
	void ClosePanel();
};

// 0x28 (0x3D0 - 0x3A8)
// Class FortniteUI.AthenaLobbyPlayerPanel
class UAthenaLobbyPlayerPanel : public UFortLobbyPlayerPanel
{
public:
	class UCommonButton*                         Button_Mute;                                       // 0x3A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ViewProfile;                                // 0x3B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                            Text_BattlePassTier;                               // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                            Text_BattlePassSelfXP;                             // 0x3C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                            Text_BattlePassSharedXP;                           // 0x3C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaLobbyPlayerPanel* GetDefaultObj();

	void OnIsMutedUpdated(bool bIsMuted);
	void OnHasBattlePassUpdated(bool bHasBattlePass);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortViewModel
class UFortViewModel : public UObject
{
public:

	static class UClass* StaticClass();
	static class UFortViewModel* GetDefaultObj();

};

// 0xB0 (0xD8 - 0x28)
// Class FortniteUI.FortPlayerViewModel
class UFortPlayerViewModel : public UFortViewModel
{
public:
	uint8                                        Pad_170A[0xB0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortPlayerViewModel* GetDefaultObj();

};

// 0xA0 (0x178 - 0xD8)
// Class FortniteUI.AthenaPlayerViewModel
class UAthenaPlayerViewModel : public UFortPlayerViewModel
{
public:
	uint8                                        Pad_170E[0xA0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerViewModel* GetDefaultObj();

};

// 0x20 (0x198 - 0x178)
// Class FortniteUI.AthenaLocalPlayerViewModel
class UAthenaLocalPlayerViewModel : public UAthenaPlayerViewModel
{
public:
	class AFortPlayerControllerAthena*           PlayerController;                                  // 0x178(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaIndicatorPlayersCache*          IndicatorCache;                                    // 0x180(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortPlayerPawn*>               ListeningForPawnStates;                            // 0x188(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaLocalPlayerViewModel* GetDefaultObj();

	void HandleViewTargetPlayerStateReplicated(class AFortPlayerPawn* Pawn);
};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.AthenaLootStoreScreenBase
class UAthenaLootStoreScreenBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaLootStoreScreenBase* GetDefaultObj();

};

// 0x18 (0x118 - 0x100)
// Class FortniteUI.AthenaMapLayer
class UAthenaMapLayer : public UWidget
{
public:
	uint8                                        Pad_171A[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class ULocalPlayer*                          LocalPlayer;                                       // 0x110(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaMapLayer* GetDefaultObj();

	void SetLocalPlayer(class ULocalPlayer* LocalPlayer);
	void FlashPlayerIcon();
	void ClearTouches();
};

// 0x1B0 (0x450 - 0x2A0)
// Class FortniteUI.AthenaMarkedActorIndicator
class UAthenaMarkedActorIndicator : public UFortActorIndicatorWidget
{
public:
	uint8                                        Pad_171B[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortWorldMarkerData                  MarkerData;                                        // 0x2C0(0x108)(Protected, NativeAccessSpecifierProtected)
	struct FMarkedActorDisplayInfo               MarkerDisplay;                                     // 0x3C8(0x68)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UFortMarkerDetailsTable*               DetailsTable;                                      // 0x430(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FreshLargeItemShowTime;                            // 0x438(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        IndicatorDotSizeThreshold;                         // 0x43C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                       Switcher_IndicatorSize;                            // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Distance;                                     // 0x448(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMarkedActorIndicator* GetDefaultObj();

};

// 0x10 (0x278 - 0x268)
// Class FortniteUI.AthenaMarkerDetails
class UAthenaMarkerDetails : public UFortHUDElementWidget
{
public:
	class UAthenaMarkerPointer*                  MarkerPointer;                                     // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMarkerDetailsTable*               DetailsTable;                                      // 0x270(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaMarkerDetails* GetDefaultObj();

	void UpdateMarkerData(struct FFortWorldMarkerData& MarkerData);
	void UpdateMarkerAction(enum class EFortMarkerActions MarkerAction);
};

// 0x20 (0x120 - 0x100)
// Class FortniteUI.AthenaMarkerPointer
class UAthenaMarkerPointer : public UWidget
{
public:
	class UMaterialInterface*                    LineMeshMaterial;                                  // 0x100(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             TargetScreenPosition;                              // 0x108(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1725[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaMarkerPointer* GetDefaultObj();

	void SetTargetScreenPosition(const struct FVector2D& InTargetScreenPosition);
	void SetLineMeshMaterial(class UMaterialInterface* Material);
};

// 0x18 (0x240 - 0x228)
// Class FortniteUI.AthenaMatchReadyDesktopPopup
class UAthenaMatchReadyDesktopPopup : public UUserWidget
{
public:
	uint8                                        Pad_1728[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaMatchReadyDesktopPopup* GetDefaultObj();

	void UserDismissedDialog(bool bBringToFront);
};

// 0x8 (0x108 - 0x100)
// Class FortniteUI.AthenaMinimap
class UAthenaMinimap : public UWidget
{
public:
	struct FVector2D                             DesiredSize;                                       // 0x100(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaMinimap* GetDefaultObj();

};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.AthenaPickingLayer
class UAthenaPickingLayer : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaPickingLayer* GetDefaultObj();

};

// 0x38 (0x260 - 0x228)
// Class FortniteUI.AthenaPlayerHitPointBarBase
class UAthenaPlayerHitPointBarBase : public UUserWidget
{
public:
	uint8                                        Pad_1730[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x238(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EHealthBarType                    BarType;                                           // 0x240(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1731[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ValueCurrent;                                      // 0x244(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BeginDeltaInterpDelayMin;                          // 0x248(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BeginDeltaInterpDelayMax;                          // 0x24C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ValueLast;                                         // 0x250(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ValueMax;                                          // 0x254(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastToCurrentUpdateRate;                           // 0x258(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1732[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerHitPointBarBase* GetDefaultObj();

	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	void OnValueChangedWithReason(float Value, enum class EFortHitPointModificationReason Reason);
	void OnMaxValueChanged(float Value);
	void OnDeltaChanged();
	void OnDBNOStateChanged(bool IsDBNO);
	float GetLastValuePercentage();
	float GetCurrentValuePercentage();
};

// 0x10 (0x2B0 - 0x2A0)
// Class FortniteUI.AthenaPlayerIndicatorBase
class UAthenaPlayerIndicatorBase : public UFortActorIndicatorWidget
{
public:
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x2A0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x2A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaPlayerIndicatorBase* GetDefaultObj();

	void TalkingStateChanged(class AFortPlayerStateAthena* PS, bool bTalking);
	void ShowCallout(enum class ETeamMemberState Callout);
	void SetViewModel(class UAthenaPlayerViewModel* InPlayerVM);
	void RefreshCurrentPawn();
	void PlayerNameChanged(class AFortPlayerStateAthena* PS, const class FString& PlayerName);
	void DBNOStateChanged(class AFortPlayerStateAthena* PS, bool bDBNO);
	void BeingRevivedStateChanged(class AFortPlayerStateAthena* PS, bool bReviving);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaPlayerInfoBaseWidgetInterface
class IAthenaPlayerInfoBaseWidgetInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAthenaPlayerInfoBaseWidgetInterface* GetDefaultObj();

};

// 0x100 (0x368 - 0x268)
// Class FortniteUI.AthenaPlayerInfoBase
class UAthenaPlayerInfoBase : public UFortHUDElementWidget
{
public:
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x268(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateColor                           Color_PlayerNameAlive;                             // 0x270(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FSlateColor                           Color_PlayerNameDead;                              // 0x298(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FSlateColor                           Color_PlayerNameDisconnected;                      // 0x2C0(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_174C[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_HealthBar;                                   // 0x2F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ShieldBar;                                   // 0x300(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_DBNOBar;                                     // 0x308(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_PlatformIcon;                                // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_PlayerName;                                   // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Marker;                                      // 0x320(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                           DBNOStateWidget;                                   // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_DeadIndicator;                               // 0x330(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_DisconnectedIndicator;                       // 0x338(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ResurrectChip;                               // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ResurrectionChipExpirationBar;               // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVoiceChatStatusIcon*              SpeakerWidget;                                     // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVoiceChatStatusIconProxyAnim*     SpeakerWidgetAnim;                                 // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1751[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerInfoBase* GetDefaultObj();

	void UpdateResurrectionExpirationWidget();
	void TalkingStateChanged(class AFortPlayerStateAthena* PS, bool bTalking);
	void SetPlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SendEpicFriendInvite();
	void OnTalkingStateStartedOrEnded(bool bIsTalking);
	void OnResurrectionStateChanged(struct FFortResurrectionUIData& ResurrectionStateData);
	void OnPlaylistLoaded(class FName PlaylistName, struct FGameplayTagContainer& PlaylistContextTags);
	void OnPlaylistExtensionWidgetCreated(class UUserWidget* Widget);
	void OnGameModeIconChange(class AFortPlayerStateAthena* PS, class UTexture2D* NewGameModeIcon);
	void OnDisplayAddFriend(bool bShowAnimation);
	void MutedStateChanged(class AFortPlayerStateAthena* PS, bool Muted);
	void HandleSpectatingChanged(class AFortPlayerStateZone* NewSpectatingTarget);
	void DBNOStateChanged(class AFortPlayerStateAthena* PS, bool bDBNO);
	void BeingRevivedStateChanged(class AFortPlayerStateAthena* PS, bool bReviving);
};

// 0x18 (0x280 - 0x268)
// Class FortniteUI.AthenaPlayerKillsBase
class UAthenaPlayerKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            KillsText;                                         // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               KillsSource;                                       // 0x270(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomKillSource;                                 // 0x278(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1757[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerKillsBase* GetDefaultObj();

	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};

// 0x18 (0x280 - 0x268)
// Class FortniteUI.AthenaPlayersLeftBase
class UAthenaPlayersLeftBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_1759[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayersLeftBase* GetDefaultObj();

	void SetPlayersLeftText(class FText& PlayersText);
};

// 0x18 (0x280 - 0x268)
// Class FortniteUI.AthenaPlayerTeamKillsBase
class UAthenaPlayerTeamKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            KillsText;                                         // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               KillsSource;                                       // 0x270(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomKillSource;                                 // 0x278(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_175C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerTeamKillsBase* GetDefaultObj();

	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};

// 0x8 (0x230 - 0x228)
// Class FortniteUI.AthenaPlayerVitalityBarBase
class UAthenaPlayerVitalityBarBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x228(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaPlayerVitalityBarBase* GetDefaultObj();

	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
};

// 0x20 (0x250 - 0x230)
// Class FortniteUI.AthenaPostMatchBattlePass
class UAthenaPostMatchBattlePass : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_BattlePassTier;                               // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_BattlePassProgress;                           // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_TotalStarsEarned;                             // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                      Image_BattlePassEmblem;                            // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaPostMatchBattlePass* GetDefaultObj();

};

// 0x50 (0x280 - 0x230)
// Class FortniteUI.AthenaPostMatchChallengeProgress
class UAthenaPostMatchChallengeProgress : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_ChallengeTitle;                               // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  Text_ChallengeComplete;                            // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        Image_RewardPreview;                               // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        Image_Checkmark;                                   // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CurrentProgress;                              // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MaxProgress;                                  // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        Image_ProgressBar;                                 // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MatchStatTitle;                               // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_XPGained;                                     // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  Text_BattlePassBonus;                              // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaPostMatchChallengeProgress* GetDefaultObj();

};

// 0xC8 (0x2F8 - 0x230)
// Class FortniteUI.AthenaPostMatchDetailedStats
class UAthenaPostMatchDetailedStats : public UCommonUserWidget
{
public:
	uint8                                        Pad_1764[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_EliminationCount;                             // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_AssistCount;                                  // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_RevivesCount;                                 // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_AccuracyPercent;                              // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_HitsCount;                                    // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_HeadShotCount;                                // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_DistanceTraveled;                             // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MaterialsGathered;                            // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MaterialsUsed;                                // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_DamageTaken;                                  // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_DamageToPlayers;                              // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_DamageToStructures;                           // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadEliminationCount;                        // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadAssistCount;                             // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadRevivesCount;                            // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadAccuracyPercent;                         // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadHitsCount;                               // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadHeadShotCount;                           // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadDistanceTraveled;                        // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadMaterialsGathered;                       // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadMaterialsUsed;                           // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadDamageTaken;                             // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadDamageToPlayers;                         // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_SquadDamageToStructures;                      // 0x2F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaPostMatchDetailedStats* GetDefaultObj();

	void GetMatchStats();
};

// 0x18 (0x248 - 0x230)
// Class FortniteUI.AthenaPostMatchMatchStat
class UAthenaPostMatchMatchStat : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_StatTitle;                                    // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_BonusContribution;                            // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_XPGained;                                     // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaPostMatchMatchStat* GetDefaultObj();

};

// 0x0 (0x2A0 - 0x2A0)
// Class FortniteUI.AthenaPostMatchScreenBase
class UAthenaPostMatchScreenBase : public UFortActorIndicatorWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaPostMatchScreenBase* GetDefaultObj();

};

// 0x20 (0x250 - 0x230)
// Class FortniteUI.AthenaPostMatchSeasonLevel
class UAthenaPostMatchSeasonLevel : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_SeasonLevel;                                  // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_TotalXPGained;                                // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CurrentXP;                                    // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        ProgressBar_LevelProgress;                         // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaPostMatchSeasonLevel* GetDefaultObj();

};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.AthenaPostMatchXPBreakdown
class UAthenaPostMatchXPBreakdown : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_ContributionTitle;                            // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_XPEarned;                                     // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaPostMatchXPBreakdown* GetDefaultObj();

};

// 0x28 (0x170 - 0x148)
// Class FortniteUI.AthenaProfileStatBox
class UAthenaProfileStatBox : public USizeBox
{
public:
	UMulticastInlineDelegateProperty_            OnStatViewChanged;                                 // 0x148(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bRespectParentStatView;                            // 0x158(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_177A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaBaseStatView*                   StatView;                                          // 0x160(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_177B[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaProfileStatBox* GetDefaultObj();

	void SetStatView(class UAthenaBaseStatView* InStatView, bool RespectParentStatView);
	void OnStatViewChanged__DelegateSignature(class UAthenaBaseStatView* StatView);
	struct FFortUIStatStyle GetStatStyle(struct FGameplayTag& InStat);
	class UAthenaBaseStatView* GetBaseStatView();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaBaseStatView
class UAthenaBaseStatView : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAthenaBaseStatView* GetDefaultObj();

	float GetStat(struct FGameplayTag& InStat);
};

// 0x10 (0x38 - 0x28)
// Class FortniteUI.AthenaWeaponStatView
class UAthenaWeaponStatView : public UAthenaBaseStatView
{
public:
	uint8                                        Pad_1781[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaWeaponStatView* GetDefaultObj();

	class UFortWeaponItemDefinition* GetWeaponDefinition();
};

// 0xB0 (0xD8 - 0x28)
// Class FortniteUI.AthenaMatchStatView
class UAthenaMatchStatView : public UAthenaBaseStatView
{
public:
	uint8                                        Pad_178B[0xA0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAthenaWeaponStatView*>         WeaponStatViews;                                   // 0xC8(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMatchStatView* GetDefaultObj();

	TArray<class UAthenaWeaponStatView*> GetWeaponViews();
	class UAthenaWeaponStatView* GetWeaponViewHighestStat(struct FGameplayTag& InStat);
	TArray<class UAthenaWeaponStatView*> GetSortedWeaponViews(struct FGameplayTag& InStat);
	class FString GetMatchID();
	struct FDateTime GetMatchEndTime();
};

// 0x20 (0xF8 - 0xD8)
// Class FortniteUI.AthenaMatchSetStatView
class UAthenaMatchSetStatView : public UAthenaMatchStatView
{
public:
	class UAthenaSeasonStats*                    OwningSeason;                                      // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  PlaylistId;                                        // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UAthenaMatchStatView*>          BestMatches;                                       // 0xE8(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMatchSetStatView* GetDefaultObj();

	class UAthenaSeasonStats* GetOwningSeason();
	TArray<class UAthenaMatchStatView*> GetBestMatchViews();
};

// 0x18 (0x48 - 0x30)
// Class FortniteUI.AthenaProfileStatContext
class UAthenaProfileStatContext : public UBlueprintContextBase
{
public:
	UMulticastInlineDelegateProperty_            OnStatsProfileLoaded;                              // 0x30(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_1793[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaProfileStatContext* GetDefaultObj();

	void OnAthenaStatsProfileLoaded__DelegateSignature(class UFortMcpProfileAthenaStats* StatProfile);
	TArray<class UAthenaMatchStatView*> CreateMatchViews(TArray<struct FAthenaMatchStats>& InRecentMatches);
	class UAthenaMatchSetStatView* CreateMatchStatView(class UAthenaSeasonStats* StatSet, class FName Bucket);
	class UAthenaMatchStatView* CreateCurrentMatchStatView();
};

// 0x10 (0xB50 - 0xB40)
// Class FortniteUI.AthenaProfileStatListWidgetBase
class UAthenaProfileStatListWidgetBase : public UCommonButton
{
public:
	uint8                                        Pad_1795[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaProfileStatBox*                 ProfileStatBox;                                    // 0xB48(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaProfileStatListWidgetBase* GetDefaultObj();

	void OnStatChanged();
	void HandleStatViewChanged(class UAthenaBaseStatView* StatView);
};

// 0x58 (0x370 - 0x318)
// Class FortniteUI.AthenaProfileStatsBase
class UAthenaProfileStatsBase : public UCommonActivatablePanel
{
public:
	class UAthenaProfileStatBox*                 ProfileStatBox;                                    // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaSeasonStats*>            StatSets;                                          // 0x320(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UAthenaSeasonStats*                    CurrentViewedStatSet;                              // 0x330(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaMatchStatView*                  CurrentStatView;                                   // 0x338(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  CurrentPlaylist;                                   // 0x340(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_179B[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaProfileStatsBase* GetDefaultObj();

	void Setup(struct FUniqueNetIdRepl& InUniqueId);
	void PrevStatSet();
	void OnStatSetChanged();
	void OnStartFetchingData();
	void OnProfileLoaded(class UFortMcpProfileAthenaStats* ProfileAthenaStats);
	void OnNoData();
	void OnDataRecieved();
	int32 NumStatSets();
	void NextStatSet();
	void NextPlaylist();
	struct FUniqueNetIdRepl GetUniqueID();
	class UAthenaSeasonStats* GetCurrentStatSet();
	class FText GetCurrentPlaylistName();
};

// 0x38 (0x350 - 0x318)
// Class FortniteUI.AthenaProfileStatsRecentMatchesBase
class UAthenaProfileStatsRecentMatchesBase : public UCommonActivatablePanel
{
public:
	TArray<class UAthenaMatchStatView*>          RecentMatches;                                     // 0x318(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17AB[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaProfileStatsRecentMatchesBase* GetDefaultObj();

	void Setup(struct FUniqueNetIdRepl& InUniqueId);
	void OnStartFetchingData();
	void OnRecentMatcheChanged();
	void OnProfileLoaded(class UFortMcpProfileAthenaStats* ProfileAthenaStats);
	void OnNoData();
	void OnDataRecieved();
	struct FUniqueNetIdRepl GetUniqueID();
	TArray<class UAthenaMatchStatView*> GetRecentMatches();
};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.AthenaProfileStatWidgetBase
class UAthenaProfileStatWidgetBase : public UCommonUserWidget
{
public:
	struct FGameplayTag                          Stat;                                              // 0x230(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaProfileStatBox*                 ProfileStatBox;                                    // 0x238(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaProfileStatWidgetBase* GetDefaultObj();

	void SetStatView(class UAthenaBaseStatView* InStatView, bool RespectParentStatView);
	void SetAsStat(struct FGameplayTag& InStat);
	void OnStatChanged();
	void HandleStatViewChanged(class UAthenaBaseStatView* StatView);
	TArray<struct FStatGroupData> CreateWeaponGroupData(int32 MaxToReturn, bool bIncludeOtherCategory, bool bPercentages);
};

// 0x450 (0x550 - 0x100)
// Class FortniteUI.AthenaQuickBarNativeCell
class UAthenaQuickBarNativeCell : public UWidget
{
public:
	struct FVector2D                             SelectionOffset;                                   // 0x100(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SelectionAnimLength_Seconds;                       // 0x108(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17BA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateBrush                           EmptyCell_Brush;                                   // 0x110(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                             EmptyCell_Padding;                                 // 0x198(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           SelectedCell_Brush;                                // 0x1A0(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           ItemPortrait_Brush;                                // 0x228(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           SlotOccupiedPortrait_Brush;                        // 0x2B0(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           AmmoType_Brush;                                    // 0x338(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                             AmmoTypeIcon_Size;                                 // 0x3C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             AmmoTypeIcon_Padding;                              // 0x3C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                        ItemCount_Font;                                    // 0x3D0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          ItemCount_Color;                                   // 0x420(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ItemCount_OutlineAlphaFactor;                      // 0x430(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17BB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateBrush                           GadgetFuel_Brush;                                  // 0x438(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                             GadgetFuel_Padding;                                // 0x4C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GadgetFuelChargeCount_OutlineAlphaFactor;          // 0x4C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17BD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateFontInfo                        GadgetFuelChargeCount_Font;                        // 0x4D0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          GadgetFuelChargeCount_Color;                       // 0x520(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bShowSelectedWhenEmpty : 1;                        // Mask: 0x1, PropSize: 0x10x530(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17BE[0x1F];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaQuickBarNativeCell* GetDefaultObj();

	void SetItemToRepresent(class UFortItem* InItemToRepresent);
	void SetIsSelected(bool bInSelected);
	void SetIsOccupiedByAnotherSlot(bool bInIsSlotOccupiedByAnotherSlot);
	void DesiredSizeOverride(float WidthOverride, float HeightOverride);
};

// 0x10 (0x460 - 0x450)
// Class FortniteUI.AthenaRebootCardIndicator
class UAthenaRebootCardIndicator : public UAthenaMarkedActorIndicator
{
public:
	class UCommonTextBlock*                      Text_PlayerName;                                   // 0x450(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_PlayerMarker;                                // 0x458(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaRebootCardIndicator* GetDefaultObj();

	void SetupCountdown(float StartTimeLocalWorld, float EndTimeLocalWorld);
	void HandleDisplayForSelf(bool bSelf);
};

// 0x18 (0x280 - 0x268)
// Class FortniteUI.AthenaRebootChipDirective
class UAthenaRebootChipDirective : public UFortHUDElementWidget
{
public:
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x268(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortPlayerStateAthena*>        SquadMemebers;                                     // 0x270(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaRebootChipDirective* GetDefaultObj();

	void UpdateSquadListDisplay(enum class EAthenaSquadListUpdateType UpdateType, class AFortPlayerStateAthena* PS);
	void SetViewModel(class UAthenaPlayerViewModel* InPlayerVM);
};

// 0x10 (0x460 - 0x450)
// Class FortniteUI.AthenaRebootVanIndicator
class UAthenaRebootVanIndicator : public UAthenaMarkedActorIndicator
{
public:
	int32                                        SpawnMachineIndex;                                 // 0x450(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ESpawnMachineState                SpawnMachineState;                                 // 0x454(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17C8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SpawnMachineCooldownStartTime;                     // 0x458(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SpawnMachineCooldownEndTime;                       // 0x45C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaRebootVanIndicator* GetDefaultObj();

	void OnSpawnMachineStateChanged();
};

// 0x230 (0x258 - 0x28)
// Class FortniteUI.AthenaRemotePlayerViewData
class UAthenaRemotePlayerViewData : public UObject
{
public:
	UMulticastInlineDelegateProperty_            OnPlayerStateChanged;                              // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnTeamColorChanged;                                // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSquadIdChanged;                                  // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnPlayerNameChanged;                               // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnKillScoreChanged;                                // 0x68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocationChanged;                                 // 0x78(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnHealthHealed;                                    // 0x88(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnHealthDamaged;                                   // 0x98(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnShieldHealed;                                    // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnShieldDamaged;                                   // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnDBNOStateChanged;                                // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnDeadStateChanged;                                // 0xD8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnBeingRevivedStateChanged;                        // 0xE8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnDisconnectedChanged;                             // 0xF8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnPlayerPawnChanged;                               // 0x108(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnWeaponChanged;                                   // 0x118(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnDistanceToStormChanged;                          // 0x128(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnPlaceChanged;                                    // 0x138(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnMaterialCountChanged;                            // 0x148(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnIsInRelevancyChanged;                            // 0x158(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnIsFollowedPlayerChanged;                         // 0x168(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnIsReplayRelevancyPlayerChanged;                  // 0x178(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnVehicleStateChanged;                             // 0x188(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnVehicleHealthHealed;                             // 0x198(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnVehicleHealthDamaged;                            // 0x1A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      PlayerUID;                                         // 0x1B8(0x28)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x1E0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1813[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerPawn*                       CachedPlayerPawn;                                  // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1814[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaRemotePlayerViewData* GetDefaultObj();

	void WeaponDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, class AFortWeapon* WeaponParam);
	void VehicleDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, class AActor* VehicleParam1, class AActor* VehicleParam2);
	void UpdatePlayerPawn();
	void UpdateDistanceToStorm();
	void UInt8Delegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, uint8 IntParam);
	void TwoFloatDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, float FloatParam, float FloatParamMax);
	void StringDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, const class FString& StringParam);
	void SetPlayerState(class AFortPlayerStateAthena* InPlayerState);
	void PlayerStateDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, class AFortPlayerStateAthena* PlayerState);
	void PawnDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, class AFortPlayerPawn* PawnParam);
	void LinearColorDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, const struct FLinearColor& ColorParam);
	void IntDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, int32 IntParam);
	float GetVehicleMaxHealth();
	float GetVehicleHealthPercent();
	float GetVehicleHealth();
	class AActor* GetVehicle();
	struct FLinearColor GetTeamColor();
	uint8 GetSquadId();
	float GetShieldPercent();
	void GetShield(float* Shield, float* ShieldMax);
	struct FUniqueNetIdRepl GetPlayerUID();
	class AFortPlayerStateAthena* GetPlayerState();
	class AFortPlayerPawn* GetPlayerPawn();
	class FString GetPlayerName();
	int32 GetPlace();
	int32 GetMaterialCount();
	class FString GetLocation();
	int32 GetKillScore();
	bool GetIsReplayRelevancyPlayer();
	bool GetIsInRelevancy();
	bool GetIsFollowedPlayer();
	bool GetIsEliminated();
	bool GetIsDrivingVehicle();
	bool GetIsDisconnected();
	bool GetIsDead();
	bool GetIsDBNO();
	bool GetIsBeingRevived();
	bool GetInAircraft();
	float GetHealthPercent();
	void GetHealth(float* Health, float* HealthMax);
	int32 GetDistanceToStorm();
	class AFortWeapon* GetCurrentWeapon();
	void ForwardOnWeaponChanged(class AFortWeapon* InNewWeapon, class AFortWeapon* InPrevWeapon);
	void ForwardOnVehicleStateChanged(class AFortPlayerPawn* InPawn, class AActor* InNewVehicle, class AActor* InOldVehicle);
	void ForwardOnVehicleHealthChanged();
	void ForwardOnSquadIdChanged(uint8 InSquadId);
	void ForwardOnPlayerNameChanged(class AFortPlayerStateAthena* InPlayerState, const class FString& InPlayerName);
	void ForwardOnPlaceChanged(class AFortPlayerStateAthena* Sender, int32 InPlace);
	void ForwardOnLocationChanged(const class FString& InLocation);
	void ForwardOnKillScoreChanged(class AFortPlayerStateAthena* InPlayerState, int32 InKillScore);
	void ForwardOnHitPointsStateChanged(class AFortPlayerStateAthena* InPlayerState, float InHealth, float InHealthMax, float InShield, float InShieldMax);
	void ForwardOnDisconnectedChanged(class AFortPlayerStateAthena* InPlayerState, bool bInIsDisconnected);
	void ForwardOnDeadStateChanged(class AFortPlayerStateAthena* InPlayerState, bool bInIsDead);
	void ForwardOnDBNOStateChanged(class AFortPlayerStateAthena* InPlayerState, bool bInIsDBNO);
	void ForwardOnBeingRevivedStateChanged(class AFortPlayerStateAthena* InPlayerState, bool bInIsBeingRevived);
	void BoolDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, bool BoolParam);
};

// 0x28 (0x1A0 - 0x178)
// Class FortniteUI.AthenaRemotePlayerViewModel
class UAthenaRemotePlayerViewModel : public UAthenaPlayerViewModel
{
public:
	class AFortPlayerControllerSpectating*       PlayerController;                                  // 0x178(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortPlayerStateAthena*>        SquadList;                                         // 0x180(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AFortPlayerStateAthena*>        NameIndicatedPlayers;                              // 0x190(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaRemotePlayerViewModel* GetDefaultObj();

	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorPC, class AFortPlayerState* NewFollowedPlayer);
};

// 0x90 (0xB8 - 0x28)
// Class FortniteUI.AthenaRemoteSquadViewData
class UAthenaRemoteSquadViewData : public UObject
{
public:
	UMulticastInlineDelegateProperty_            OnPlayerAdded;                                     // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSquadIdChanged;                                  // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSquadKillscoreChanged;                           // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSquadPlaceChanged;                               // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSquadColorChanged;                               // 0x68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSquadEliminated;                                 // 0x78(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UAthenaRemotePlayerViewData*>   PlayerDataArray;                                   // 0x88(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1827[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaRemoteSquadViewData* GetDefaultObj();

	void UInt8Delegate__DelegateSignature(class UAthenaRemoteSquadViewData* SquadData, uint8 IntParam);
	void PlayerDelegate__DelegateSignature(class UAthenaRemoteSquadViewData* SquadData, class UAthenaRemotePlayerViewData* PlayerData);
	void LinearColorDelegate__DelegateSignature(class UAthenaRemoteSquadViewData* SquadData, const struct FLinearColor& ColorParam);
	void IntDelegate__DelegateSignature(class UAthenaRemoteSquadViewData* SquadData, int32 IntParam);
	void HandlePlayerPlaceChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InPlace);
	void HandlePlayerKillscoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InKillScore);
	void HandlePlayerDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool InEliminated);
	int32 GetSquadId();
	struct FLinearColor GetSquadColor();
	TArray<class UAthenaRemotePlayerViewData*> GetPlayerDatas();
	int32 GetPlace();
	class UFortMinigameTeamIdentification* GetMinigameTeamId();
	int32 GetKillScore();
	bool GetIsEliminated();
	void EventDelegate__DelegateSignature(class UAthenaRemoteSquadViewData* SquadData);
};

// 0x80 (0x2B0 - 0x230)
// Class FortniteUI.AthenaReplayActionFeedRowBase
class UAthenaReplayActionFeedRowBase : public UCommonUserWidget
{
public:
	uint8                                        Pad_1830[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_EventIcon;                                   // 0x238(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_EventTime;                                    // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_InstigatorButton;                           // 0x248(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_VictimButton;                               // 0x250(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             Texture_EliminationIcon;                           // 0x258(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             Texture_DbnoIcon;                                  // 0x280(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaReplayActionFeedRowProxyInstance* RowProxy;                                          // 0x2A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaReplayActionFeedRowBase* GetDefaultObj();

	void OnVictimNameUpdated(class FText& VictimName);
	void OnPlayerStateAdded(class AFortPlayerStateAthena* FPSA);
	void OnInstigatorNameUpdated(class FText& InstigatorName);
	struct FUniqueNetIdRepl GetVictimId();
	struct FUniqueNetIdRepl GetInstigatorId();
	float GetEventTime();
};

// 0xE8 (0x110 - 0x28)
// Class FortniteUI.AthenaReplayActionFeedRowProxyInstance
class UAthenaReplayActionFeedRowProxyInstance : public UObject
{
public:
	uint8                                        Pad_1834[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FReplayEliminationEventInfo           RowData;                                           // 0x30(0xE0)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaReplayActionFeedRowProxyInstance* GetDefaultObj();

};

// 0x8 (0x348 - 0x340)
// Class FortniteUI.AthenaReplayActionFeedScreenBase
class UAthenaReplayActionFeedScreenBase : public UFortActivatablePanel
{
public:
	uint8                                        Pad_183A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaReplayActionFeedScreenBase* GetDefaultObj();

	void OnRowProxiesUpdated(TArray<class UAthenaReplayActionFeedRowProxyInstance*>& RowProxies);
	void OnReplayEventsUpdated(enum class EPlayEventType Type);
};

// 0x10 (0xB50 - 0xB40)
// Class FortniteUI.AthenaReplayBrowserEntryWidget
class UAthenaReplayBrowserEntryWidget : public UCommonButton
{
public:
	uint8                                        Pad_183D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               ReplayBrowserEntryObject;                          // 0xB48(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaReplayBrowserEntryWidget* GetDefaultObj();

	void OnReplayBrowserEntryDataSet();
	class FText GetDateTimeText(const struct FDateTime& DateTime);
};

// 0x90 (0xB8 - 0x28)
// Class FortniteUI.AthenaReplayBrowserRowProxyInstance
class UAthenaReplayBrowserRowProxyInstance : public UObject
{
public:
	struct FAthenaReplayBrowserRowData           RowData;                                           // 0x28(0x90)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaReplayBrowserRowProxyInstance* GetDefaultObj();

};

// 0x78 (0x3B8 - 0x340)
// Class FortniteUI.AthenaReplayBrowserScreenBase
class UAthenaReplayBrowserScreenBase : public UFortActivatablePanel
{
public:
	TArray<class UAthenaReplayBrowserRowProxyInstance*> RowProxies;                                        // 0x340(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   PlayActionRowHandle;                               // 0x350(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   DeleteActionRowHandle;                             // 0x360(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   RenameActionRowHandle;                             // 0x370(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   RefreshActionRowHandle;                            // 0x380(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   BackActionRowHandle;                               // 0x390(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_184D[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaReplayBrowserScreenBase* GetDefaultObj();

	void ShowDeleteInvalidDialog(class FText& Title, class FText& MESSAGE);
	void SaveAndRenameReplay(class UAthenaReplayBrowserRowProxyInstance* RowProxy, const class FString& NewReplayName);
	void RenameReplay(class UAthenaReplayBrowserRowProxyInstance* RowProxy, const class FString& NewReplayName);
	void PlayReplay(class UAthenaReplayBrowserRowProxyInstance* RowProxy);
	void OnSaveFailed(class FText& Reason);
	void OnRowsUpdated();
	void OnRenameFailed(class FText& Reason);
	void OnRenameActionExecuted(bool* bPassThrough);
	void OnRefreshActionExecuted(bool* bPassThrough);
	void OnPlayFailed(class FText& Reason);
	void OnPlayActionExecuted(bool* bPassThrough);
	void OnDeleteFailed(class FText& Reason);
	void OnDeleteActionExecuted(bool* bPassThrough);
	void OnBackActionExecuted(bool* bPassThrough);
	void OnActionStarted();
	void OnActionFinished();
	bool IsStreamingReplayViewEnabled();
	bool IsHandlingAction();
	bool DoesReplayFolderExist();
	void DeleteReplay(class UAthenaReplayBrowserRowProxyInstance* RowProxy);
	void DeleteInvalidReplays();
	void BrowseToReplayFolder();
	bool AreExternalActionsOutstanding();
	bool AreAnyActionsOutstanding();
};

// 0x0 (0x268 - 0x268)
// Class FortniteUI.AthenaResourcesBase
class UAthenaResourcesBase : public UFortHUDElementWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaResourcesBase* GetDefaultObj();

};

// 0x10 (0x278 - 0x268)
// Class FortniteUI.AthenaRespawnBase
class UAthenaRespawnBase : public UFortHUDElementWidget
{
public:
	enum class ERespawnUIState                   RespawnState;                                      // 0x268(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1851[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaRespawnBase* GetDefaultObj();

	void UpdateAllUI();
	void OnUpdateRespawnState(bool bEnabled);
	void OnGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
};

// 0x0 (0x268 - 0x268)
// Class FortniteUI.AthenaScorePopWidgetBase
class UAthenaScorePopWidgetBase : public UFortHUDElementWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaScorePopWidgetBase* GetDefaultObj();

	void OnNewScoreEarned(int32 NewScoreValue, class FText& NewScoreTypeText, int32 BigScoreThreshold);
	void HandleNewScoreEarned(int32 NewPoints, enum class EAthenaScoringEvent ScoreType);
};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.AthenaSeasonStatusWidget
class UAthenaSeasonStatusWidget : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaSeasonStatusWidget* GetDefaultObj();

};

// 0x50 (0x390 - 0x340)
// Class FortniteUI.AthenaSpectateMatchModalBase
class UAthenaSpectateMatchModalBase : public UFortActivatablePanel
{
public:
	uint8                                        Pad_185B[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpectateMatchModalBase* GetDefaultObj();

	void JoinGameSession(const class FString& GameSessionIdStr);
	void JoinFriendSession(const class FString& FriendName);
	bool IsGameSessionString(const class FString& String);
	void GetFriendNames(TArray<class FString>* FriendNames);
	void BuildFriendNameIdMap();
};

// 0x18 (0x248 - 0x230)
// Class FortniteUI.AthenaSpectatorBuildCountBase
class UAthenaSpectatorBuildCountBase : public UCommonUserWidget
{
public:
	TSubclassOf<class ABuildingSMActor>          BuildingClass;                                     // 0x230(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ESpectatorBuildCountType          BuildCountType;                                    // 0x238(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1862[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpectatorBuildCountBase* GetDefaultObj();

	void UpdateBuildCount();
	void OnWorldItemListChanged(TArray<class UFortWorldItem*>& ItemsAdded, TArray<class UFortWorldItem*>& ItemsRemoved);
	void OnFollowedPlayerChanged_BP();
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatingPC, class AFortPlayerState* NewFollowedPlayer);
	void OnBuildCountChanged(int32 OldCount, int32 NewCount);
};

// 0x18 (0x248 - 0x230)
// Class FortniteUI.AthenaSpectatorHitPointBarBase
class UAthenaSpectatorHitPointBarBase : public UCommonUserWidget
{
public:
	enum class EHealthBarType                    BarType;                                           // 0x230(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1868[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LastToCurrentUpdateRate;                           // 0x234(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsDBNO;                                           // 0x238(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_186A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UAthenaRemotePlayerViewData> PlayerData;                                        // 0x23C(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_186B[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpectatorHitPointBarBase* GetDefaultObj();

	void SetPlayerData(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnValueHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InValue, float InValueMax);
	void OnValueDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InValue, float InValueMax);
	void OnEliminatedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsEliminated);
	void OnDeltaValueChanged(float InDeltaValue);
	void OnDBNOStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDBNO);
	void OnDBNOChanged(bool bInIsDBNO);
	void OnCurrentValueChanged(float InCurrentValue);
};

// 0x8 (0x238 - 0x230)
// Class FortniteUI.AthenaSpectatorHUDControlsBase
class UAthenaSpectatorHUDControlsBase : public UCommonUserWidget
{
public:
	class UIconTextButtonSpectatorBase*          IconTextButtonReplay_PlayHighlights;               // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaSpectatorHUDControlsBase* GetDefaultObj();

	void ResetFocusToPlayPauseIfNeeded();
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorPC, class AFortPlayerState* NewFollowedPlayer);
	void OnCameraTypeChangedInternal(class AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType);
	void OnCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType);
	void HandleReplayHighlightsAvailable(class AFortReplaySpectator* Sender, bool bIsAvailable);
	void HandleBattleMapTimelineModeChanged(bool bIsOnTimelineMode);
	void CenterControls();
};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.AthenaSpectatorInventorySlotBase
class UAthenaSpectatorInventorySlotBase : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaSpectatorInventorySlotBase* GetDefaultObj();

	void SetItem(class UFortItem* Item);
	void SetIsSelected(bool bIsSelected);
	class UFortItem* GetItem();
};

// 0x30 (0x370 - 0x340)
// Class FortniteUI.AthenaSpectatorPlayerListBase
class UAthenaSpectatorPlayerListBase : public UAthenaEventScreenBase
{
public:
	UMulticastInlineDelegateProperty_            OnSortMethodChanged;                               // 0x340(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCommonListView*                       ListView;                                          // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaRemotePlayerViewData*>   PlayerDataArray;                                   // 0x358(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	enum class ESpectatorPlayerListSortMethod    CurrentSortMethod;                                 // 0x368(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_187B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpectatorPlayerListBase* GetDefaultObj();

	void SortMethodDelegate__DelegateSignature(enum class ESpectatorPlayerListSortMethod SortMethodParam);
	void SetSortMethod(enum class ESpectatorPlayerListSortMethod InNewSortMethod);
	void FocusListView(class UAthenaRemotePlayerViewData* ItemToFocus);
};

// 0x28 (0x398 - 0x370)
// Class FortniteUI.AthenaSpectatorMapPlayerListBase
class UAthenaSpectatorMapPlayerListBase : public UAthenaSpectatorPlayerListBase
{
public:
	class UAthenaMapLayer*                       MapLayer;                                          // 0x370(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_188C[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpectatorMapPlayerListBase* GetDefaultObj();

	void SetSquadIdsVisible_BP(bool bSquadIdsVisible);
	void SetEventScoreColumnVisible(bool bVisible);
	void OnToggleOnlyShowMapPlayersActionExecuted(bool* bPassThrough);
	void OnSortByStateActionExecuted(bool* bPassThrough);
	void OnSortBySquadIdActionExecuted(bool* bPassThrough);
	void OnSortByPlayerNameActionExecuted(bool* bPassThrough);
	void OnSortByEventScoreActionExecuted(bool* bPassThrough);
	void OnSortByEliminationsActionExecuted(bool* bPassThrough);
	void OnPlayerSquadIdChanged(class UAthenaRemotePlayerViewData* InPlayerData, uint8 InSquadId);
	void OnPlayerNameChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InPlayerName);
	void OnPlayerKillScoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InKillScore);
	void OnPlayerIsInRelevancyChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsInRelevancy);
	void OnPlayerEliminatedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsEliminated);
	void OnListItemClicked(class UObject* Item);
	enum class ESpectatorPlayerListSortMethod GetNextSortMethod();
};

// 0x8 (0x270 - 0x268)
// Class FortniteUI.AthenaSpectatorMaterialCountsBase
class UAthenaSpectatorMaterialCountsBase : public UFortHUDElementWidget
{
public:
	bool                                         bIsInBuildMode;                                    // 0x268(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1893[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpectatorMaterialCountsBase* GetDefaultObj();

	float TimeToDisplay();
	void OnReplayScrubComplete();
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatingPC, class AFortPlayerState* FollowedPS);
	void OnBuildModeChanged();
	void OnBuildingMaterialChanged(enum class EFortResourceType BuildingMaterial);
};

// 0x20 (0x2C0 - 0x2A0)
// Class FortniteUI.AthenaSpectatorNameplateBase
class UAthenaSpectatorNameplateBase : public UFortActorIndicatorWidget
{
public:
	float                                        DistanceToCameraOffsetScale;                       // 0x2A0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MinZOffset;                                        // 0x2A4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxZOffset;                                        // 0x2A8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOverrideNameplateScaleToMax;                      // 0x2AC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_18A6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UAthenaRemotePlayerViewData> PlayerData;                                        // 0x2B0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EAthenaSpectatorNameplateDistanceState CurrentDistanceState;                              // 0x2B8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EAthenaSpectatorNameplateDetailState CurrentDetailState;                                // 0x2B9(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_18A7[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpectatorNameplateBase* GetDefaultObj();

	void SetTeamColorVisible(bool bTeamColorVisible);
	void SetSquadIdVisibility(bool bSquadIdVisible);
	void SetArrowTeamColorVisible(bool bArrowTeamColorVisible);
	void OnVehicleStateChanged_BP(class UAthenaRemotePlayerViewData* InPlayerData, class AActor* InNewVehicle, class AActor* InOldVehicle);
	void OnVehicleStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AActor* InNewVehicle, class AActor* InOldVehicle);
	void OnTeamColorChanged(class UAthenaRemotePlayerViewData* InPlayerData, const struct FLinearColor& InTeamColor);
	void OnSquadIDsDisplayModeHoldUpdate();
	void OnSquadIdChanged(class UAthenaRemotePlayerViewData* InPlayerData, uint8 InSquadId);
	void OnPlayerPawnChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerPawn* InPlayerPawn);
	void OnPlayerNameChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InPlayerName);
	void OnPlayerDataSet(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnDistanceStateChanged(enum class EAthenaSpectatorNameplateDistanceState NewDistanceState);
	void OnDetailStateChanged(enum class EAthenaSpectatorNameplateDetailState NewDetailState);
};

// 0x60 (0x2C8 - 0x268)
// Class FortniteUI.AthenaSpectatorNameplateLayerBase
class UAthenaSpectatorNameplateLayerBase : public UFortHUDElementWidget
{
public:
	TSubclassOf<class UAthenaSpectatorNameplateBase> NameplateWidgetClass;                              // 0x268(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FUniqueNetIdRepl, class UAthenaSpectatorNameplateBase*> NameplateWidgetMap;                                // 0x270(0x50)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UFortActorCanvas*                      Canvas_NameplateIndicators;                        // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaSpectatorNameplateLayerBase* GetDefaultObj();

	void OnTeamColorVisibleChanged(bool bVisible);
	void OnSquadIdsVisibilityChanged(bool bSquadIdsVisible);
	void OnPlayerDataAdded(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnArrowTeamColorVisibleChanged(bool bVisible);
};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.AthenaSpectatorPlayerWidgetBase
class UAthenaSpectatorPlayerWidgetBase : public UCommonUserWidget
{
public:
	uint8                                        Pad_18C6[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpectatorPlayerWidgetBase* GetDefaultObj();

	void SetPlayerData(class UAthenaRemotePlayerViewData* InPlayerData, bool bForceUpdate);
	void OnTeamColorChanged(const struct FLinearColor& TeamColor);
	void OnStormcapScoreChanged(float Score);
	void OnSquadIdVisibilityChanged(bool bVisible);
	void OnSquadIdChanged(uint8 SquadId);
	void OnShieldHealed(float Shield, float ShieldMax);
	void OnShieldDamaged(float Shield, float ShieldMax);
	void OnPlayerStateChanged(class AFortPlayerStateAthena* PlayerState);
	void OnPlayerPawnChanged(class AFortPlayerPawn* PlayerPawn);
	void OnPlayerNameChanged(const class FString& PlayerName);
	void OnPlayerDataChanged(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnPlaceChanged(int32 Place);
	void OnPipModeChanged(bool bPipModeEnabled);
	void OnMaterialCountChanged(int32 Count);
	void OnLocationChanged(const class FString& Location);
	void OnKillScoreChanged(int32 KillScore);
	void OnIsReplayRelevancyPlayerChanged(bool bIsReplayRelevancyPlayer);
	void OnIsInRelevancyChanged(bool bIsInRelevancy);
	void OnIsFollowedPlayerChanged(bool bIsFollowedPlayer);
	void OnHealthHealed(float Health, float HealthMax);
	void OnHealthDamaged(float Health, float HealthMax);
	void OnEventScoreChanged(int32 EventScore);
	void OnDisconnectedChanged(bool bIsDisconnected);
	void OnDeadStateChanged(bool bIsDead);
	void OnDBNOStateChanged(bool bIsDBNO);
	void OnBeingRevivedStateChanged(bool bIsBeingRevived);
	void HandleTeamColorChanged(class UAthenaRemotePlayerViewData* InPlayerData, const struct FLinearColor& TeamColor);
	void HandleSquadIdChanged(class UAthenaRemotePlayerViewData* InPlayerData, uint8 SquadId);
	void HandleShieldHealed(class UAthenaRemotePlayerViewData* InPlayerData, float Shield, float MaxShield);
	void HandleShieldDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float Shield, float MaxShield);
	void HandlePlayerStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerStateAthena* PlayerState);
	void HandlePlayerNameChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& PlayerName);
	void HandlePlaceChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 Place);
	void HandleMaterialCountChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 MaterialCount);
	void HandleKillScoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 KillScore);
	void HandleIsReplayRelevancyPlayerChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsReplayRelevancyPlayer);
	void HandleIsInRelevancyChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsInRelevancy);
	void HandleIsFollowedPlayerChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsFollowedPlayer);
	void HandleHealthHealed(class UAthenaRemotePlayerViewData* InPlayerData, float Health, float MaxHealth);
	void HandleHealthDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float Health, float MaxHealth);
	void HandleDisconnectedChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDisconnected);
	void HandleDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDead);
	void HandleDBNOStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDBNO);
	void HandleBeingRevivedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsBeingRevived);
	class UAthenaRemotePlayerViewData* GetPlayerData();
};

// 0x50 (0x290 - 0x240)
// Class FortniteUI.AthenaSpectatorPlayerListEntryBase
class UAthenaSpectatorPlayerListEntryBase : public UAthenaSpectatorPlayerWidgetBase
{
public:
	class UCommonBorder*                         Border_SquadColor;                                 // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
