#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xEB8 (0x10D0 - 0x218)
// ControlRigBlueprintGeneratedClass Mech_Veh_ControRig_Parts.Mech_Veh_ControRig_Parts_C
class UMech_Veh_ControRig_Parts_C : public UControlRig
{
public:
	struct FRigUnit_BeginExecution               BeginExecution_0;                                  // 0x218(0x38)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_AimBone                      AimBone_0;                                         // 0x250(0x100)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                      Paw_Calf_L;                                        // 0x350(0xF0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation              SetBoneRotation_0;                                 // 0x440(0x60)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform      GetInitialBoneTransform_0;                         // 0x4A0(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_AimBone                      AimBone_1;                                         // 0x510(0x100)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform      GetInitialBoneTransform_1;                         // 0x610(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                      Paw_Thigh_L;                                       // 0x680(0xF0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation              SetBoneRotation_1;                                 // 0x770(0x60)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_AimBone                      AimBone_2;                                         // 0x7D0(0x100)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_AimBone                      AimBone_3;                                         // 0x8D0(0x100)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                      Clav_L;                                            // 0x9D0(0xF0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform      GetInitialBoneTransform_2;                         // 0xAC0(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation              SetBoneRotation_2;                                 // 0xB30(0x60)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform      GetInitialBoneTransform_5;                         // 0xB90(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                      Upperarm_L;                                        // 0xC00(0xF0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation              SetBoneRotation_4;                                 // 0xCF0(0x60)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                      Clav_R;                                            // 0xD50(0xF0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform      GetInitialBoneTransform_8;                         // 0xE40(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation              SetBoneRotation_6;                                 // 0xEB0(0x60)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform      GetInitialBoneTransform_9;                         // 0xF10(0x70)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                      Upperarm_R;                                        // 0xF80(0xF0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation              SetBoneRotation_7;                                 // 0x1070(0x60)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UMech_Veh_ControRig_Parts_C* GetDefaultObj();

};

}


