#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x9542 (0x9D72 - 0x830)
// AnimBlueprintGeneratedClass Mech_Veh_AnimBP.Mech_Veh_AnimBP_C
class UMech_Veh_AnimBP_C : public UFortOstrichAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x830(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_8354E408499433F98E24F68F55B7B700; // 0x838(0x30)(None)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_C737C1ED40B00DEE4C6DD28D60E38B04; // 0x868(0x220)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6FAD1DB945E2E9B22A5B268B5293ECFC; // 0xA88(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_C06F361F432A22CA7D58FD9D6680AF3F; // 0xB90(0x20)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2F1850F342738CFF9C711A8058FD2C91; // 0xBB0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AF3EBD91493C6DD7A4E83EB2CB941758; // 0xBD8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_182789A0489885602465A0972F07D03F; // 0xC00(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AD7B28384A0E6B41527368A6F7113A83; // 0xC28(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F0973BFD4BD5EE03C7072E956E3D564E; // 0xC50(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4D8317C344F7870A41B92C92C7070E9F; // 0xC78(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9C1F583A46C98B440569C9B02C058A1F; // 0xCA0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_39479CF540EFE19812F9C69F5EC54C99; // 0xCC8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4D8254874FE181E3F7DAEEAA2BC31519; // 0xCF0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AF10B34F4E54985B40CB88AA5BC06630; // 0xD18(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2811B9274DCC50C98C94D1B30B537F9F; // 0xD40(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_422CDF1B4B415C8891B387989E63BB48; // 0xD68(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5075F2DA4D067BBEFCC81D94F4C8C927; // 0xD90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_115C73AC4D3727BBC0F43E8D9ED20F4F; // 0xDB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18F7AA1B49D6B632BC3C8EB75179E01C; // 0xDE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A30A38C34D3AEAA8E6E314A437B260AE; // 0xE08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_286B3A9548079F4ED31AD586B29FF849; // 0xE30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_47F661EF4A25BA01D18F94AB00480D12; // 0xE58(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BDC52E3E48DB61306E3C92A69EFC7432; // 0xE80(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4C3032E04AEC99EDB0B793846B2CD031; // 0xEA8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D9D280054D6488FA01E361A676DE11D6; // 0xED0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7911962243261FF3FEA7F2BAEFAFEA0B; // 0xEF8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_EFC6FFA6437E8348C9D29EBE4FB06F98; // 0xF20(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E7EF472D4085338F4F411C9180F7FD4C; // 0xF48(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_497D10F446CCC38DFC1F06A0AE054F7A; // 0xF70(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8D399CFC41EC4F4B2B00A583CE1F4F9C; // 0xF98(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FFC552AA44E74DAC952472B09DA0ED6C; // 0xFC0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_976FB94A4BFB4F6862461B8EAB451728; // 0xFE8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_85B69065477590C85E7543AFDF2501D4; // 0x1010(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E6F7CF8443BA3BA02FFC8D9FB5BC1594; // 0x1038(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CC2C692145BC18EF627B758396F0B7F5; // 0x1060(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F0CD3ECA4FE18D1811112FBF4A40070E; // 0x1088(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AF3DE14F460AC3C713B134AFE836E82C; // 0x10B0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1BFC401B43B3258E5828269D90DD4BD2; // 0x10D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11BFFFA24C729754A185A6A729C1F71C; // 0x1100(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_80035EBC4BB1B24AD1066880B9819168; // 0x1128(0x28)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_DF8341974D1ED78B31E9FCAA3A1F8AC1; // 0x1150(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_FEB716784F251A353451AB8A6B06F1D7; // 0x1170(0x20)(None)
	struct FFortAnimNode_SpeedWarping            FortAnimGraphNode_SpeedWarping_0547F56D4505B5670642DB9E5B9F7DE5; // 0x1190(0x1B8)(None)
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_26C570FF49B6433F0575A0A38441C6F3; // 0x1348(0xA0)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_D17C15694083EB9BEBF942ABC346A8F6; // 0x13E8(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_AD63192240A234A8C7207AA4C97E02C2; // 0x1430(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_715C41724627BE0D45DBE48E1565D770; // 0x1460(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_21EE9F264F34767134A84693C5A1F252; // 0x14D8(0x30)(None)
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_9F50674548613934CB19FBAE9BE34FC8; // 0x1508(0xA0)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_06661E3543276C87C63E3BAFD3441567; // 0x15A8(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5629FCCA48CD27C6F1E452AF5EA2479A; // 0x15F0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4279722D4D7EA4D0BA4EE1B5CDAB409F; // 0x1620(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_E54C494547E8C585BAFFBF95DF7F7795; // 0x1698(0x30)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_BE2E2DFE4544FF849B17558DBC653BCF; // 0x16C8(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DA18D3D64DFC8EA0CE05BC89AFDB8ABF; // 0x1768(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4ADAEAC24BF5FEB65054DEAF6A7578BD; // 0x17E0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_EBCF5CFF4CE56823BE9B83B64CDDD031; // 0x1858(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_930842344C0116560B10F39EED7B79D9; // 0x1888(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9D4D9FD24FA84880FDF16F97411FAA21; // 0x1900(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3EB931DB41871DA2911C9494960F1A20; // 0x1930(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_C97F7D4149C3837BCE45BDA73EB30667; // 0x19A8(0x30)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4F3A54194A7B192E28843E91837C10D9; // 0x19D8(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_269AF89B4652B7D9A1F9FFA15ED76A33; // 0x19F8(0x20)(None)
	struct FFortAnimNode_SpeedWarping            FortAnimGraphNode_SpeedWarping_CAB376A241331017615BF9B19F419EBF; // 0x1A18(0x1B8)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_A55CEFCC44348FF854AEA3A7B142A8C4; // 0x1BD0(0xC8)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_554CABAD4EA46C201627CFB0453EE06C; // 0x1C98(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_127DD327483E8777CC7869AE4CA26EDD; // 0x1D78(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_255145E549CEACCA839048B0554AFE40; // 0x1DA0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3C38CE094D68C6B0204E5BAEEAAABA31; // 0x1DD0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_91C64F1C44AD9F1D70CC66A22B740649; // 0x1E48(0x30)(None)
	struct FAnimNode_RandomPlayer                AnimGraphNode_RandomPlayer_308A226643EFC6C5A5CE79A23A7EC896; // 0x1E78(0x68)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_99B9060C45481B53DB8E039CA7424B73; // 0x1EE0(0x28)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_D0CDB42F4A61A4A5B44D959CFD845819; // 0x1F08(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7E2EDEA549A6B921223C41AE25BB92B9; // 0x1FD0(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_8A982F8A483848F4CC72F084DC861574; // 0x2000(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8F3B6B4B41E596A62E8D578CF1A4BE15; // 0x20B0(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_D53387044E9A7762A1DD6E9A5D536FC0; // 0x20E0(0xB0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_182CC21943F6AA5210E73F95F633573A; // 0x2190(0xB8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CA29C4AB48488800432B93926EC789D9; // 0x2248(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BC14B48D4CAE7E9B9EFCB19A0843E053; // 0x2270(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_44D7F517407CF092979E01A396725BF8; // 0x2298(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3FA597244D051854BDF78EACC177A7F2; // 0x22C0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_927A75464E88BB19DF399CB2F9A8AFA7; // 0x22E8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F5EF571B4713BF0C0CF311B8FD95C0EE; // 0x2310(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_728AC961403B5CFEFB152E817A46A6CA; // 0x2338(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A8EE35F4409AE010FFC58A8C083EB396; // 0x2360(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AD1AD372422A06CBFDD167800447A26C; // 0x2388(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2728AC514E7BAD955173CB8F3F15BE0A; // 0x23B0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C7CD2FEE43098B82FD6E91BCA0551D25; // 0x23D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_60AEB4AD465655E13888819023091954; // 0x2400(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F7CC6995409C6734411684B9B69F90E9; // 0x2428(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9EEA66F64DC498E38F034CA2C8E8E837; // 0x2450(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5FFFBA8049E5FFD5F84871AEC81096B1; // 0x2478(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4EE5B31249849D7C3E8208B12BDAE95C; // 0x24A0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3C039E154FB31E802DFB19B75D545136; // 0x24C8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_96859F3A40E788405F5DF981092795A2; // 0x24F0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_005788524C1D6900F7B0B4BEDBA37968; // 0x2518(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CDF7600645260871767F5888363A1BAA; // 0x2540(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_266ABBE84D88ADAD33D5C6A188FCFB0B; // 0x2568(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C51C84D846E6834CF7472487BCB30BCA; // 0x2590(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0942F1FE44BFF7F44BDF1C9BEB40B716; // 0x25B8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CB32E0814BE1AC069C3E5DBD213F23E8; // 0x25E0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BEDC6BC94C82913EE659D0BECA07185C; // 0x2608(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CDD69CE14F6A02BC691D2C9619EC441D; // 0x2630(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23AEB5A4444853D0EDEB28935008857F; // 0x2658(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_EA31D8AD4992EE261FD0EBB118E4F37B; // 0x2680(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_595EE68A4BBCED1B931BC2ABF4BDBA80; // 0x26A8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_36F0A4B24FAA779001F0B8A5F2190505; // 0x26D0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_66D7F4764034F37463D343947E32DBE2; // 0x26F8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7037CAED4F2F032F26147FB4C9889010; // 0x2720(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CE94E65541CC757BD95D008AEFF6A105; // 0x2748(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_908F013D4B69755E10DD65A37B68E884; // 0x2770(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_192A06E24FF28F1763612A975C269DCB; // 0x2798(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D1301D554114AA8032F0B5BEDE3A761B; // 0x27C0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_AAD729A745282EB878EBFFA898E9AC88; // 0x2838(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17AC4C7549C44C4CA5240E8BC04AD430; // 0x2868(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_59D2533045D78F2BF7A4B182CDFC90CF; // 0x28E0(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6A18884A499BACCDA1665E9693564F4B; // 0x2910(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0AE05BEF430A8E04B0967CA1BC7596B7; // 0x2938(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8C1CC52C44A28FBE4B360AB6D744F18F; // 0x29B0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3D71CBF1438A5B8B042ADB8AD965EFD5; // 0x29E0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7E807FD54EA262FABAF39C8FAC4CC143; // 0x2A58(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_FC4E382C492D7B7F99E9F19A5408A226; // 0x2A88(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F8AD907C49105E8E6B0DC586588AB396; // 0x2B38(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11F370154856AB293C91B59814072A89; // 0x2B68(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9C6666AD41BF31F1D8A1ECB8F17858CD; // 0x2B90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4319637E4088CE61CEDED4B13F9C7837; // 0x2BB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_594B71704F1CA43C32500382BD091B7A; // 0x2BE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6F5C7EB34FE0EE7C20550CB4DA0864CD; // 0x2C08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F10F9BD24618792BBE71C88C00C040F1; // 0x2C30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_628B446742D445B45A84D389386F2402; // 0x2C58(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CE1508DE4D7A7DA11B1E27A4EE6DF062; // 0x2C80(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B379C5454137C8B16F65F984698D1A7C; // 0x2CA8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4E30AB734EF49260A58C13B9A77ACDB4; // 0x2CD0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_102E9C97467495F96C288A83502EBCB8; // 0x2CF8(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C90070A94A0937D3A967778FF18E9BD2; // 0x2D20(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9970028142C993D68F8948897A28C7B7; // 0x2D98(0x30)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_641AD45E4724EC699275CD8EE21BAC98; // 0x2DC8(0xE0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7C2AAD3F4E7C8911165F0C8B64C62FA7; // 0x2EA8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C6FFC5994109F0A299FA5184B742273E; // 0x2ED8(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_FA1ABF554BFC6B677A91988E82565EFA; // 0x2F50(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7ECEF27A465A242200819C81CD767E40; // 0x3018(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7C55E3FB4320C4EA0BBA2E8C423E76C1; // 0x3090(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_47F00AD943E965B96A8242879B0F5346; // 0x30C0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_128412D347C0F33AF21C029A114C0C22; // 0x3138(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_C09D603540A2B8A94B5CA1855DAC9FB0; // 0x3168(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_FC99652D43AFAC44EAF37F916AC071E0; // 0x3190(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_61F64C744D843C5252B2BA8ED00530BA; // 0x31C0(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_D361198745C3E66E4CE1D8B30AF997C4; // 0x3270(0x30)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_B849C2684E441AB10BB6EC93DF071222; // 0x32A0(0xA0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_8183E1D34B3BE9454DF372BB33F712BE; // 0x3340(0xE0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_046021EC488406C2B71F88ADEBF8B8BA; // 0x3420(0xE0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_236D6B40435B412A2F62DE91A0F580B3; // 0x3500(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3ECE60FF4A4A833903ED78B895ED73B1; // 0x3530(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_CE43FB1B462AE4DD1F6A4FA3A568CC3D; // 0x35A8(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_528133D24982BC3F46F8F1AAE2DE3F66; // 0x3648(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F1441A1A4ABB100D0372328E050AB582; // 0x36C0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7D4690564AD15F847865BBA7D41F310C; // 0x36F0(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4A0D11BD436A42709BA08FAB75AF7708; // 0x3768(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1D6DBA43433FFB4E533ED290CC76E669; // 0x3808(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_B0E892B5445A9C7FA3C363BF0202F11A; // 0x3880(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6068D944427C330193DB52974A3BFA9D; // 0x38B0(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9F220C0C4858C0983AA5B291B6F4532B; // 0x38D8(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_F68A92294BB188DFD3D2BEA6085BFFED; // 0x3908(0xB0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_F56993CC41050301E5C1A29A05A41981; // 0x39B8(0xC0)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8597CB54492666CB5A0E52A25379E585; // 0x3A78(0x20)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_A037BB09423BE00B9678588CA64C5712; // 0x3A98(0xA0)(None)
	struct FAnimNode_CopyPoseFromMesh            AnimGraphNode_CopyPoseFromMesh_4AA859E04E858951387001ADE583E5DB; // 0x3B38(0x140)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_598F12584F7F55D33474E6BDAF7B2A83; // 0x3C78(0xB8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D37165BB4140AD21BB40A19D9D7DA5B8; // 0x3D30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C9AAC776498ECF524E101C97967D00BF; // 0x3D58(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1D6B91F14C0E355C353088962477264A; // 0x3D80(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_593CEE91483D3E01EEE6A2B8F1E0F029; // 0x3DA8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_47810EE44CC305573F3A01ACC6C4FFE6; // 0x3DD0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_74D401224565E37186A5B3A53251C872; // 0x3DF8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9BB66D454F4076F10D2CE099AB450202; // 0x3E20(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_775761F54A8B19991F07E0B3CCC9A195; // 0x3E48(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BEA0DE3E42F312265810FF9EF7E536F8; // 0x3E70(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3910351C4678618B3515528B1354156C; // 0x3EE8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EB812DB743D03B387354DA963D9652E9; // 0x3F18(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_408D543C47F90F7AC86EF8AD8BDD4743; // 0x3F90(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4C52C5DB48CF088928D70A9F8A938549; // 0x3FC0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_CF9EC1C847D971F99F2207885F866124; // 0x4038(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_624DCBBA4771824439F85AB62B2F5141; // 0x4068(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6CAA15B14F06282EFE873BB38BB33E20; // 0x4090(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_63BC21B54C1A0492FD9C0382F6B396CA; // 0x40C0(0xB0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_0F94735E4201031036E7B895278C6A81; // 0x4170(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7C0298C24D8D825C166F0BB24A16A19D; // 0x4228(0x28)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_8954C3DC493FA5D826A6C9A0CBD59B93; // 0x4250(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7A5724504DE355ECA10DE9B8E3AF6CB6; // 0x4358(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3BC3F9C241C4AF820441CBB3F58575FA; // 0x4378(0x108)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_450E8C7F44347CF712E982A2B33DE7FA; // 0x4480(0x20)(None)
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_01BB015F44927E60085F7489009F8874; // 0x44A0(0xA0)(None)
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_02BADB594988B93DD98C4997D5F0643A; // 0x4540(0x220)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A8DA70DD4BD25C1E6D5B6780807B366C; // 0x4760(0x78)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_ED6B036E43397B9C2296548602FBEFDB; // 0x47D8(0xC0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_2D125280476D49D1209E1DAC9DA11AB7; // 0x4898(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_270FBDA2485D7193E67359BC1E3F7EE9; // 0x48E0(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1F33D34546C609FDF85D27ABE0BC8B9A; // 0x4998(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_220012AA43DD4760BC2A2DAC8FDFFB27; // 0x49C0(0xC0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D7160CF64BB5FF186D2616908911D2D3; // 0x4A80(0x78)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_D6DBC8DC42BFAD493A5C4498EEABC515; // 0x4AF8(0x48)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_E6FEA1BA4D2CC42476E72EAE8318E079; // 0x4B40(0x48)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_A37AEC9448D71931626389A24AA8C501; // 0x4B88(0xC0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_662FD25C4293937C8F0021BAFC73F356; // 0x4C48(0x28)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_FAB9724443056CDFBD52ABA66A5D5D3E; // 0x4C70(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F307956747747270A0A49DA161F9259A; // 0x4C90(0x20)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_03B84A6F4BA425D9B98EF1A3966A6E27; // 0x4CB0(0xC8)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_351A1D764D98C379FEA248973D137ECE; // 0x4D78(0xE0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_B6A3B3C046679153DE6E49A60A0246E8; // 0x4E58(0xA0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_00A43B38418B46CEA149719587EA25A9; // 0x4EF8(0x48)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_AD08D4ED4EFD0837BCCB0EBE8496CA33; // 0x4F40(0xC0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_308751044DE4DFFFBC0A4E803983DF29; // 0x5000(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_385DFBB14222A627E09E5F9E14DA5A6C; // 0x5028(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_FC9BEBD04DAEF84C2A7DAA9614355FC5; // 0x50A0(0xC8)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_27DE9A924B87CF486B99A3B72802461E; // 0x5168(0xC0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_868E9BF44D5EE7AC36E87DBF062F93C9; // 0x5228(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_34DB56F545E1A403D7BE9E8F03700724; // 0x52E0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_AE269C844ECE36854E27CBBC0199B5CC; // 0x5308(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_0A6F322240D1463A5343EF8B7A47832D; // 0x5330(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_54D675464AC571A33D6FCA9A958FB431; // 0x53E8(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8BD7522A43587F181563B48AE1C9755A; // 0x5410(0x78)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_76B4295747D57B1E2C22F0AF09E4ED75; // 0x5488(0xC0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_202357DF436223C0B9AE23A332809006; // 0x5548(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_9E2CBEA9477DF57BAAD8D9930BC7B825; // 0x5650(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3237EE9347360567394CC9ACCDFA301C; // 0x5758(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_FCE2381949CCA6CFDA65469F72F9922B; // 0x5860(0x108)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5557C684491B1B99AFA97EB7A97A4757; // 0x5968(0x78)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_70DBFC184163B4E4A66FBE938FC5D754; // 0x59E0(0xC0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_EB99B44544B85A5F350BF38D5F790DCB; // 0x5AA0(0xC0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_205F5BE64CB249CDAEC407B98D3B8288; // 0x5B60(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_0F846F7144D51F3ED166F2B89CC0978A; // 0x5BD8(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_292CC8214DE036EA6D3ECAA8FA141E2C; // 0x5C78(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_681DE15E41B1A307F1E36BBBF809AB19; // 0x5CF0(0x78)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_D22444174DE5BA06756710B38F786BFC; // 0x5D68(0xC0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_5C99158E482DA0DFF3E5678F039D46FE; // 0x5E28(0xC0)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9C310CE84941B9AC45C4DEB0F1277ACB; // 0x5EE8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_472EA33C4DB850F28169C8AF2DAEA5C3; // 0x5F10(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2BEBBC4A4C7BC38E1981CCA1A09C561B; // 0x5F38(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EDE376FF4756F364AA23E7A4160B6FEF; // 0x5F60(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_610482794A6CE2C2907042A424A38788; // 0x5FD8(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9340A4D441A0B5DD8763A481447357E2; // 0x6008(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_B5BFF72340F295108E78D583C2C9F18A; // 0x6030(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_792DA9D04DB0C4BAE195F098A94BE8F5; // 0x6060(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8F0880C04559A43E987015A716EDEF97; // 0x60D8(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2B2427DF4CD5CFD8A22BF1837280C755; // 0x6108(0xB0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_0CF79DC442AD18257E3C9F8FDDDC5636; // 0x61B8(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_0467500B42ED2AA2B079AF8D9704C784; // 0x6270(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_B9B8B2A044F623CB0CA077A515BE5C6D; // 0x6298(0xC0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_F9A0CBDC49D9B5FE77D951961BDB9CD4; // 0x6358(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_71D2C8BC4D9EE03268F262A5CC8BE6D2; // 0x6410(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_2A1E23E844FDE3FAEBB5C982A97BFB34; // 0x6438(0xC0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_460509CC43991EF77DF4108BD1DECD7C; // 0x64F8(0xA0)(None)
	uint8                                        Pad_498C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_0EC9413348A396171B5D4881AC50CCD6; // 0x65A0(0x1B0)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_06F516EB4D5D8CC0643CD683908AF848; // 0x6750(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_033EC2134DF4422C2312FA866F4A58D8; // 0x6770(0x20)(None)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_99D00C774329C8D06A48B783A144ED4E; // 0x6790(0x188)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_EF4600D84A4444AAA68AE186FB776374; // 0x6918(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_40AB2ABC43B20CF60C364CBC22B4B101; // 0x69D0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5FF5F1664BCA468C2EB8D68E737D8B40; // 0x69F8(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_DCFA2711481C88C4787E65B465329F51; // 0x6A20(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5D13E0FB481119926699AA85AC4AFD6F; // 0x6AD8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_BC173D33408CA4304184FBAB217F33E9; // 0x6B00(0x28)(None)
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_24617A93441BCFFBA74998B03D9EC1E5; // 0x6B28(0xF8)(None)
	struct FFortAnimNode_SlopeWarping            FortAnimGraphNode_SlopeWarping_DDEBCC8C44B20FD6F66EE4A46BB1B675; // 0x6C20(0x228)(None)
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_2E2617CE42C782616EF4078532241C15; // 0x6E48(0xA0)(None)
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_87CC2CF64686F85D4E485CA9819E3AF7; // 0x6EE8(0xA0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_8877588F4AB3ACDE006A6397888470BF; // 0x6F88(0xC0)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_49083D8E42F9606EFE77BEA84B394D45; // 0x7048(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A742D2464CE2030E798127A910B34D3A; // 0x7070(0x28)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_D1B2C83044BF1D9CC57758BB129E0BB7; // 0x7098(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_172530F44D9620D6EE9B7399D55B970F; // 0x7178(0x28)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_101E875D402BE4F0D8FCC5A2C320AB17; // 0x71A0(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2F2F829D48C55AE1F2C7F0BA119433A5; // 0x7268(0x30)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_072E385C46006FB5BB7EB28DC708D9B0; // 0x7298(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_A566984342B9E47A1164B9A1497E0D92; // 0x7378(0x28)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_58A7813249D826A4DD2FDE90AC60D1C6; // 0x73A0(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F79941234C2F6F60DC25948920912271; // 0x7468(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_8244A6954531372DC5521295FA356DE3; // 0x7498(0xB0)(None)
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_B87804754BEA918A5BB316ABF182C556; // 0x7548(0xA0)(None)
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_D00A2CAB42B96A74F76567B4AE8F218A; // 0x75E8(0xA0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_F315405E455DBC90E6D1C6ACC0E4BD75; // 0x7688(0x28)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_417A45AA4F71A23EBF8A83AE69AA0F62; // 0x76B0(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F11AB7BD43431CDE821BA0A8366444B4; // 0x7778(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_22B464C64D1572DE5681068B67039DEE; // 0x77F0(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_8C42692E4A1A1F34CBA9BFA1A9C0EE27; // 0x7820(0xB0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_D36AED034D730BD67B6AEC830D76D310; // 0x78D0(0xC0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_93077A7242889AB0F1A81CBB55797B8D; // 0x7990(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_00AB3B2649FD64379A785186A9367924; // 0x7A70(0x28)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_D0D20FDC4DAD29C4295CCE977FA4EA02; // 0x7A98(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8412670A49472370C76D9B802C3B6FF0; // 0x7B60(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_37119277440343FEF7F7A9B471BF3D9D; // 0x7B90(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_69229E794117981070D7CABF87D28696; // 0x7C40(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9DCF7B6446BF6035508F7C96566969A8; // 0x7CE0(0x78)(None)
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone_4A356DC24C0635437BD28FBA4B5666DE; // 0x7D58(0xF0)(None)
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone_F6383BA547B63DA27514F29CC9DA2E36; // 0x7E48(0xF0)(None)
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone_28526B624465FEBD3543E8B0648F865A; // 0x7F38(0xF0)(None)
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone_5DB7D711430BA44D47FEA7B4B5781961; // 0x8028(0xF0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_E894928F40EC1FD39D48939B59E76A50; // 0x8118(0xE0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_E33395C6451B82A315565ABCC861FCC4; // 0x81F8(0xA0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_D94779F944CCAD6243D661A9940F56C2; // 0x8298(0x108)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_64C9F34E40741F9002FACA975E0F59EF; // 0x83A0(0xA0)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_89942EBD4A0CCDE24D7EABBDDED46A8E; // 0x8440(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_AF68E54A4A42EDDAD981DBBB4DCEAB65; // 0x8460(0x20)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_5DBA68CD4104863EC6430690708E51C4; // 0x8480(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8B95ED6840114F85C22403B360EB6311; // 0x8538(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_A28A947647B0723184FFB9B9906A0A84; // 0x8560(0x28)(None)
	uint8                                        Pad_498E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_RigidBody                   AnimGraphNode_RigidBody_9457FCA44C9870C84D28ABBF49ABE405; // 0x8590(0x560)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_ABFC4C5444063150D172B5ADD825185D; // 0x8AF0(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_70A679124D0A01F118541D9FE274DAFE; // 0x8B10(0x20)(None)
	struct FAnimNode_RigidBody                   AnimGraphNode_RigidBody_2019F83945074734F00647B238CFD9E1; // 0x8B30(0x560)(None)
	struct FFortAnimNode_OrientationWarping      FortAnimGraphNode_OrientationWarping_960D32FB4E1D45907364C5A35EF4B896; // 0x9090(0x130)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_919961A74021B61EA4A33B9AA70FE923; // 0x91C0(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_F63B5FB545269647BC850F938D1CC4A3; // 0x91E0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_68B6FD5E43A49FDAB4CE17BCC98608CE; // 0x9200(0xE0)(None)
	float                                        __CustomProperty_ChainSlide_3068211A4D983495BCC1E7BABE4149E1; // 0x92E0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_498F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_ControlRig                  AnimGraphNode_ControlRig_3068211A4D983495BCC1E7BABE4149E1; // 0x92E8(0x220)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_29C9725B479D93AA12BB14BC10BF657D; // 0x9508(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_DCB24C7A48E9023FE669C5A9EE6580DB; // 0x9550(0xE0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_F867CDA74EDEAC26F77ADCBB12633090; // 0x9630(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_5402DABA46A92384C00E3795ECBC5BCD; // 0x9738(0x108)(None)
	struct FAnimNode_Trail                       AnimGraphNode_Trail_1DD61C92486F671499B1E0BC872D8ED1; // 0x9840(0x270)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_E428332441C61D82565D25B97B072D91; // 0x9AB0(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F9E56E0E4C279EF2F3119DAC7C8F48F5; // 0x9B78(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_C7F721C24359C3E26FB5DCA0E2AE5FDA; // 0x9BF0(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C060EAE9401D1BCC3D7081A79695392D; // 0x9C90(0x78)(None)
	bool                                         DriverBootUp;                                      // 0x9D08(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4991[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequence*                         JumpBaseApex;                                      // 0x9D10(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         NormalJumpApex;                                    // 0x9D18(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         NormalJumpFall;                                    // 0x9D20(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                         NormalJumpLand;                                    // 0x9D28(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         NormalJumpLandPredicted;                           // 0x9D30(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         ChargedJumpApex;                                   // 0x9D38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         ChargedJumpFall;                                   // 0x9D40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                         ChargedJumpLand;                                   // 0x9D48(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         ChargedJumpLandPredicted;                          // 0x9D50(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         JumpBaseFall;                                      // 0x9D58(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                         JumpBaseLand;                                      // 0x9D60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         JumpBaseLandPredicted;                             // 0x9D68(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldPlayTurn90Right;                             // 0x9D70(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ShouldPlayTurn90Left;                              // 0x9D71(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UMech_Veh_AnimBP_C* GetDefaultObj();

	void AnimGraph(struct FPoseLink* AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mech_Veh_AnimBP_AnimGraphNode_ControlRig_3068211A4D983495BCC1E7BABE4149E1();
	void StartSeatTransition_DriverEnter();
	void StopSeatTransition_DriverEnter();
	void StartSeatTransition_PassengerEnter();
	void StopSeatTransition_PassengerEnter();
	void ExecuteUbergraph_Mech_Veh_AnimBP(int32 EntryPoint);
};

}


