#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x18C0 (0x7920 - 0x6060)
// AnimBlueprintGeneratedClass Ostrich_Gunner_AnimBP.Ostrich_Gunner_AnimBP_C
class UOstrich_Gunner_AnimBP_C : public UFortPlayerAnimInstance_OstrichGunner
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x6060(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_5AE654274BBAD62E84CCD3A7879BB535; // 0x6068(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F8F65B484986C7038992BB87AF2BAC85; // 0x6098(0x78)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_F220B2544C1110F602951A9D79349269; // 0x6110(0xB0)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_FCFFF87D47682CBC042FC596D4283D08; // 0x61C0(0xC8)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_8ED06EA74BE21E9A68FA01B171E2A532; // 0x6288(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_09195B3A4DFFC856685508AFDC8EB5A9; // 0x6340(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_17E964024F3F940DC93EF3B040B82CDB; // 0x6368(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_6D726F2A4FD2675FD997EFB0C4CB5EF5; // 0x6390(0xC0)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4983826C42A6E22334B8A2A70B9B8E2C; // 0x6450(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F495B9164A58BC05FB399BACBE21D497; // 0x6478(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6A33D89340DB31414D55A5A0C6F39AF7; // 0x64A0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EDD0230C48A9BD9AF22E3E82D4B1848E; // 0x64C8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_623053F94B13E7E47D519C9A21AED41C; // 0x6540(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E27A16C844A950C97F828B907EBD9D89; // 0x6570(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9B2C0A3F451E4EF978BCC6B147D4CF1F; // 0x65E8(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_544647484D03203C753274AA78D0C169; // 0x6618(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2C19960D49D35A4B5BCB0F9A3FB392E8; // 0x6640(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_AFB5EA454AFAA6F5290D51B43F544F6E; // 0x6670(0xB0)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_A76C88284E405F9C03F0A98DB3A4A00E; // 0x6720(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_525B3D34483E102B2E42D08FB852CEAC; // 0x6740(0x20)(None)
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_63EA954B4B37FBEECDA93CAED7ACBE1A; // 0x6760(0xF8)(None)
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_8D761AB94BDCA9488212C6913B37D8D4; // 0x6858(0xF8)(None)
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_1CAE5C864E54B8801DA90BB66B232CA9; // 0x6950(0xF8)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_46443AC04D2E9CE116AA1D993DB3526E; // 0x6A48(0xC8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CE2D7ECC4B6A7002673983B6BE90F573; // 0x6B10(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0AAF366749BC707ABB448F8E4E6275D3; // 0x6B38(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4A115A644649C425E4F9CC90AEE0EA5F; // 0x6B60(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_77EBF8FB404B3E3D4EBDA580C4FF13C6; // 0x6BD8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_71965715426071693C37A9A08033868B; // 0x6C08(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_30CB6FCC490360C85068769ECA19827C; // 0x6C80(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_E992F75E418DD209691650B89A84EEB0; // 0x6CB0(0xB0)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17B0F07E45EC9C1C960D18913BD82AC3; // 0x6D60(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E794D3844E7F0401350A9DAC8DDF3E40; // 0x6D88(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_91B1D7904ECDA4697D8413B1B7EAC870; // 0x6DB0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BFC395CD4B948845DED9629D68134457; // 0x6DD8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_52B7F61E4150886851CBF49B73F6952F; // 0x6E00(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12D261E44C069F574F4C1391359BAD4B; // 0x6E28(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9FDDB3B84A712D36D4A42D9F23C7E96B; // 0x6E50(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F18E97B24C0BE65E17F140988FD79648; // 0x6E78(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_63C4D35C49E515CAD043D8BF578341F6; // 0x6EA0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6E93E8134F8979A0201C428ECDD47D9D; // 0x6EC8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_C700CC9B4D2A5A5DD2C5F9AED9241D1A; // 0x6F40(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_896EC9FB4A38FB2B52CE5FB9D4125D9E; // 0x6F70(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_66D223C34803E798D9F4F3AEBA750DBE; // 0x6FE8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B48017AC4715D8F608B8A98035F3796C; // 0x7018(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3973475648433EEADB239AB07B384125; // 0x7090(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_784CEE704B6BF6F4999C34B7FC29C114; // 0x70C0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_EA19828E4F227BB2B552A889EDDF0F9B; // 0x7138(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8A2EA0FC4EF463583B20A58BEFC3B7E0; // 0x7168(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8A358BCD44C2F583A066CA8A2BFAC6D6; // 0x7190(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_F13A37F64FC9F3178EFB3A848BF31E7A; // 0x71C0(0xB0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_F7CF9C4C4FE4E0C2B3695795D31C0F60; // 0x7270(0xE0)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_46FE8D914F351C0530B06582FA964195; // 0x7350(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_02C498C946C6340253C201BCF4ACD69A; // 0x7418(0x78)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_F6BD9C9C42B9E41677683BB11C3287A1; // 0x7490(0xB8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C4E038F046816D01B2C2E596BEBCB342; // 0x7548(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_08D098914541B529E9A84B9B100EB28E; // 0x7570(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CFA7933A44DABDBBD05A86B58AE67C24; // 0x7598(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_50662ECA41E4ED4438A5D1A4B3285596; // 0x75C0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4D8C8DF24D48EF2D06F302BDE0335C33; // 0x7638(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E58BBAB743E1A31EB86B4DBE886F6AE7; // 0x7668(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_BB7EDDF24FCA8358FFD0B9BA09C21D70; // 0x76E0(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_70FC06FA4D325A634D70E997FDC4D5C6; // 0x7710(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3E8C4FC640B7D219F089B4B055279DD1; // 0x7738(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_86E4D8304467C3D9A65B26A531C43BBF; // 0x7768(0xB0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_C2B3E7244D529C26EE0B31B16CF028C0; // 0x7818(0xC0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_302A44084AAEDA02AE91519F0CDD71D3; // 0x78D8(0x48)(None)

	static class UClass* StaticClass();
	static class UOstrich_Gunner_AnimBP_C* GetDefaultObj();

	void AnimGraph(struct FPoseLink* AnimGraph);
	void ExecuteUbergraph_Ostrich_Gunner_AnimBP(int32 EntryPoint);
};

}


